burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/*!
    \file    gd32m53x_gptimer.h
    \brief   definitions for the GPTIMER

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_GPTIMER_H
#define GD32M53X_GPTIMER_H

#include "gd32m53x.h"

/* GPTIMERx(x=0,1) definitions */

#define GPTIMER0                                           GPTIMER_BASE
#define GPTIMER1                                           (GPTIMER_BASE + 0x00000100U)

/* registers definitions */
#define GPTIMER_WP(timerx)                                 REG32((timerx) + 0x00U)           /*!< GPTIMER write protect register */
#define GPTIMER_SWEN(timerx)                               REG32((timerx) + 0x04U)           /*!< GPTIMER software enable register */
#define GPTIMER_SWDIS(timerx)                              REG32((timerx) + 0x08U)           /*!< GPTIMER software disable register */
#define GPTIMER_SWRST(timerx)                              REG32((timerx) + 0x0CU)           /*!< GPTIMER software reset register */
#define GPTIMER_ESSEL(timerx)                              REG32((timerx) + 0x10U)           /*!< GPTIMER counter enable source selection register */
#define GPTIMER_DSSEL(timerx)                              REG32((timerx) + 0x14U)           /*!< GPTIMER counter disable source selection register */
#define GPTIMER_RSSEL(timerx)                              REG32((timerx) + 0x18U)           /*!< GPTIMER counter reset source selection register */
#define GPTIMER_CH0CSSEL(timerx)                           REG32((timerx) + 0x1CU)           /*!< GPTIMER channel 0 capture source selection register */
#define GPTIMER_CH1CSSEL(timerx)                           REG32((timerx) + 0x20U)           /*!< GPTIMER channel 1 capture source selection register */
#define GPTIMER_CTL0(timerx)                               REG32((timerx) + 0x24U)           /*!< GPTIMER control register 0 */
#define GPTIMER_CUPEVSSEL(timerx)                          REG32((timerx) + 0x28U)           /*!< GPTIMER count up event source selection register */
#define GPTIMER_CDNEVSSEL(timerx)                          REG32((timerx) + 0x2CU)           /*!< GPTIMER count down event source selection register */
#define GPTIMER_CH0CTL(timerx)                             REG32((timerx) + 0x30U)           /*!< GPTIMER channel 0 control register */
#define GPTIMER_CH1CTL(timerx)                             REG32((timerx) + 0x34U)           /*!< GPTIMER channel 1 control register */
#define GPTIMER_CHCTL(timerx)                              REG32((timerx) + 0x38U)           /*!< GPTIMER channel control register */
#define GPTIMER_DMAINTEN(timerx)                           REG32((timerx) + 0x3CU)           /*!< GPTIMER dma and interrupt enable register */
#define GPTIMER_INTF(timerx)                               REG32((timerx) + 0x40U)           /*!< GPTIMER interrupt flag register */
#define GPTIMER_UPSSEL(timerx)                             REG32((timerx) + 0x44U)           /*!< GPTIMER update source selection register */
#define GPTIMER_CNT(timerx)                                REG32((timerx) + 0x48U)           /*!< GPTIMER counter register */
#define GPTIMER_PSC(timerx)                                REG32((timerx) + 0x4CU)           /*!< GPTIMER prescaler  register */
#define GPTIMER_CAR(timerx)                                REG32((timerx) + 0x50U)           /*!< GPTIMER counter auto reload  register */
#define GPTIMER_CH0CV(timerx)                              REG32((timerx) + 0x54U)           /*!< GPTIMER channel 0 capture/compare value register */
#define GPTIMER_CH1CV(timerx)                              REG32((timerx) + 0x58U)           /*!< GPTIMER channel 1 capture/compare value register */
#define GPTIMER_CH0COMV_ADD(timerx)                        REG32((timerx) + 0x5CU)           /*!< GPTIMER channel 0 additional compare value register */
#define GPTIMER_CH1COMV_ADD(timerx)                        REG32((timerx) + 0x60U)           /*!< GPTIMER channel 1 additional compare value register */
#define GPTIMER_DTCTL(timerx)                              REG32((timerx) + 0x64U)           /*!< GPTIMER dead-time control register */
#define GPTIMER_ADCTL(timerx)                              REG32((timerx) + 0x68U)           /*!< GPTIMER ADC trigger control register */
#define GPTIMER_ADCCR1(timerx)                             REG32((timerx) + 0x6CU)           /*!< GPTIMER ADC trigger compare value 1 register */
#define GPTIMER_ADCCR2(timerx)                             REG32((timerx) + 0x70U)           /*!< GPTIMER ADC trigger compare value 2 register */
#define GPTIMER_ADCTRGS(timerx)                            REG32((timerx) + 0x74U)           /*!< GPTIMER ADC trigger skipping register */
#define GPTIMER_ADDINTSCTL0(timerx)                        REG32((timerx) + 0x78U)           /*!< GPTIMER additional interrupt skipping control register 0 */
#define GPTIMER_ADDINTSCTL1(timerx)                        REG32((timerx) + 0x7CU)           /*!< GPTIMER additional interrupt skipping control register 1 */
#define GPTIMER_IADCTSS(timerx)                            REG32((timerx) + 0x80U)           /*!< GPTIMER interrupt and ADC trigger signal skipping register */
#define GPTIMER_CREP(timerx)                               REG32((timerx) + 0x84U)           /*!< GPTIMER counter repetition register */
#define GPTIMER_SYNRSTCTL(timerx)                          REG32((timerx) + 0x88U)           /*!< GPTIMER synchronous reset control register*/
#define GPTIMER_DMACFG(timerx)                             REG32((timerx) + 0xE0U)           /*!< GPTIMER DMA configuration register */
#define GPTIMER_DMATB(timerx)                              REG32((timerx) + 0xE4U)           /*!< GPTIMER DMA transfer buffer register */
#define GPTIMER_CFG(timerx)                                REG32((timerx) + 0xFCU)           /*!< GPTIMER configuration register */

