burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* bits definitions */
/* GPTIMER_WP */
#define GPTIMER_WP_WPEN                                    BIT(0)                            /*!< register write protect enable */
#define GPTIMER_WP_SWEWPEN                                 BIT(1)                            /*!< GPTIMER_SWEN write protect enable*/
#define GPTIMER_WP_SWDWPEN                                 BIT(2)                            /*!< GPTIMER_SWDIS write protect enable */
#define GPTIMER_WP_SWRWPEN                                 BIT(3)                            /*!< GPTIMER_SWRST write protect enable */
#define GPTIMER_WP_WPKEY                                   BITS(8,15)                        /*!< write protect key */

/* GPTIMER_SWEN */
#define GPTIMER_SWEN_GPTIMER0SWEN                          BIT(0)                            /*!< GPTIMER0 counter software enable */
#define GPTIMER_SWEN_GPTIMER1SWEN                          BIT(1)                            /*!< GPTIMER1 counter software enable */

/* GPTIMER_SWDIS */
#define GPTIMER_SWDIS_GPTIMER0SWDIS                        BIT(0)                            /*!< GPTIMER0 counter software disable */
#define GPTIMER_SWDIS_GPTIMER1SWDIS                        BIT(1)                            /*!< GPTIMER1 counter software disable */

/* GPTIMER_SWRST */
#define GPTIMER_SWRST_GPTIMER0SWRST                        BIT(0)                            /*!< GPTIMER0 counter software reset */
#define GPTIMER_SWRST_GPTIMER1SWRST                        BIT(1)                            /*!< GPTIMER1 counter software reset */

/* GPTIMER_ESSEL */
#define GPTIMER_ESSEL_ETI0ENCNT                            BITS(0,1)                         /*!< the ETI0 signal edge enable counter function enable */
#define GPTIMER_ESSEL_ETI1ENCNT                            BITS(2,3)                         /*!< the ETI1 signal edge enable counter function enable */
#define GPTIMER_ESSEL_ETI2ENCNT                            BITS(4,5)                         /*!< the ETI2 signal edge enable counter function enable */
#define GPTIMER_ESSEL_ETI3ENCNT                            BITS(6,7)                         /*!< the ETI3 signal edge enable counter function enable */
#define GPTIMER_ESSEL_CH0ENCNT                             BITS(8,9)                         /*!< the channel 0 signal edge enable counter function enable */
#define GPTIMER_ESSEL_CH1ENCNT                             BITS(10,11)                       /*!< the channel 1 signal edge enable counter function enable */
#define GPTIMER_ESSEL_EVSEL0ENCNT                          BIT(16)                           /*!< the EVSEL0 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL1ENCNT                          BIT(17)                           /*!< the EVSEL1 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL2ENCNT                          BIT(18)                           /*!< the EVSEL2 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL3ENCNT                          BIT(19)                           /*!< the EVSEL3 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL4ENCNT                          BIT(20)                           /*!< the EVSEL4 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL5ENCNT                          BIT(21)                           /*!< the EVSEL5 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL6ENCNT                          BIT(22)                           /*!< the EVSEL6 signal enable counter function enable */
#define GPTIMER_ESSEL_EVSEL7ENCNT                          BIT(23)                           /*!< the EVSEL7 signal enable counter function enable */
#define GPTIMER_ESSEL_SWENCNT                              BIT(31)                           /*!< the software signal enable counter function enable */

/* GPTIMER_DSSEL */
#define GPTIMER_DSSEL_ETI0DISCNT                           BITS(0,1)                         /*!< the ETI0 signal edge disable counter function enable */
#define GPTIMER_DSSEL_ETI1DISCNT                           BITS(2,3)                         /*!< the ETI1 signal edge disable counter function enable */
#define GPTIMER_DSSEL_ETI2DISCNT                           BITS(4,5)                         /*!< the ETI2 signal edge disable counter function enable */
#define GPTIMER_DSSEL_ETI3DISCNT                           BITS(6,7)                         /*!< the ETI3 signal edge disable counter function enable */
#define GPTIMER_DSSEL_CH0DISCNT                            BITS(8,9)                         /*!< the channel 0 signal edge disable counter function enable */
#define GPTIMER_DSSEL_CH1DISCNT                            BITS(10,11)                       /*!< the channel 1 signal edge disable counter function enable */
#define GPTIMER_DSSEL_EVSEL0DISCNT                         BIT(16)                           /*!< the EVSEL0 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL1DISCNT                         BIT(17)                           /*!< the EVSEL1 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL2DISCNT                         BIT(18)                           /*!< the EVSEL2 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL3DISCNT                         BIT(19)                           /*!< the EVSEL3 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL4DISCNT                         BIT(20)                           /*!< the EVSEL4 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL5DISCNT                         BIT(21)                           /*!< the EVSEL5 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL6DISCNT                         BIT(22)                           /*!< the EVSEL6 signal disable counter function enable */
#define GPTIMER_DSSEL_EVSEL7DISCNT                         BIT(23)                           /*!< the EVSEL7 signal disable counter function enable */
#define GPTIMER_DSSEL_SWDISCNT                             BIT(31)                           /*!< the software signal disable counter function enable */

