burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_RSSEL */
#define GPTIMER_RSSEL_ETI0RSTCNT                           BITS(0,1)                         /*!< the ETI0 signal edge reset counter function enable */
#define GPTIMER_RSSEL_ETI1RSTCNT                           BITS(2,3)                         /*!< the ETI1 signal edge reset counter function enable */
#define GPTIMER_RSSEL_ETI2RSTCNT                           BITS(4,5)                         /*!< the ETI2 signal edge reset counter function enable */
#define GPTIMER_RSSEL_ETI3RSTCNT                           BITS(6,7)                         /*!< the ETI3 signal edge reset counter function enable */
#define GPTIMER_RSSEL_CH0RSTCNT                            BITS(8,9)                         /*!< the channel 0 signal edge reset counter function enable */
#define GPTIMER_RSSEL_CH1RSTCNT                            BITS(10,11)                       /*!< the channel 1 signal edge reset counter function enable */
#define GPTIMER_RSSEL_EVSEL0RSTCNT                         BIT(16)                           /*!< the EVSEL0 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL1RSTCNT                         BIT(17)                           /*!< the EVSEL1 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL2RSTCNT                         BIT(18)                           /*!< the EVSEL2 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL3RSTCNT                         BIT(19)                           /*!< the EVSEL3 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL4RSTCNT                         BIT(20)                           /*!< the EVSEL4 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL5RSTCNT                         BIT(21)                           /*!< the EVSEL5 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL6RSTCNT                         BIT(22)                           /*!< the EVSEL6 signal reset counter function enable */
#define GPTIMER_RSSEL_EVSEL7RSTCNT                         BIT(23)                           /*!< the EVSEL7 signal reset counter function enable */
#define GPTIMER_RSSEL_CSIRSTCNT                            BITS(24,26)                       /*!< the compares match, synchronous reset or input capture reset counter function enable */
#define GPTIMER_RSSEL_SWRSTCNT                             BIT(31)                           /*!< the software signal reset counter function enable */

/* GPTIMER_CH0CSSEL */
#define GPTIMER_CH0CSSEL_ETI0CH0IC                         BITS(0,1)                         /*!< the ETI0 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_ETI1CH0IC                         BITS(2,3)                         /*!< the ETI1 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_ETI2CH0IC                         BITS(4,5)                         /*!< the ETI2 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_ETI3CH0IC                         BITS(6,7)                         /*!< the ETI3 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_CH0CH0IC                          BITS(8,9)                         /*!< the channel 0 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_CH1CH0IC                          BITS(10,11)                       /*!< the channel 1 signal edge as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL0CH0IC                       BIT(16)                           /*!< the EVSEL0 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL1CH0IC                       BIT(17)                           /*!< the EVSEL1 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL2CH0IC                       BIT(18)                           /*!< the EVSEL2 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL3CH0IC                       BIT(19)                           /*!< the EVSEL3 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL4CH0IC                       BIT(20)                           /*!< the EVSEL4 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL5CH0IC                       BIT(21)                           /*!< the EVSEL5 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL6CH0IC                       BIT(22)                           /*!< the EVSEL6 signal as the channel 0 input capture source enable */
#define GPTIMER_CH0CSSEL_EVSEL7CH0IC                       BIT(23)                           /*!< the EVSEL7 signal as the channel 0 input capture source enable */

/* GPTIMER_CH1CSSEL */
#define GPTIMER_CH1CSSEL_ETI0CH0IC                         BITS(0,1)                         /*!< the ETI0 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_ETI1CH0IC                         BITS(2,3)                         /*!< the ETI1 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_ETI2CH0IC                         BITS(4,5)                         /*!< the ETI2 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_ETI3CH0IC                         BITS(6,7)                         /*!< the ETI3 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_CH0CH0IC                          BITS(8,9)                         /*!< the channel 0 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_CH1CH0IC                          BITS(10,11)                       /*!< the channel 1 signal edge as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL0CH0IC                       BIT(16)                           /*!< the EVSEL0 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL1CH0IC                       BIT(17)                           /*!< the EVSEL1 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL2CH0IC                       BIT(18)                           /*!< the EVSEL2 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL3CH0IC                       BIT(19)                           /*!< the EVSEL3 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL4CH0IC                       BIT(20)                           /*!< the EVSEL4 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL5CH0IC                       BIT(21)                           /*!< the EVSEL5 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL6CH0IC                       BIT(22)                           /*!< the EVSEL6 signal as the channel 1 input capture source enable */
#define GPTIMER_CH1CSSEL_EVSEL7CH0IC                       BIT(23)                           /*!< the EVSEL7 signal as the channel 1 input capture source enable */

