burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_CTL0 */
#define GPTIMER_CTL0_CEN                                   BIT(0)                            /*!< counter enable */
#define GPTIMER_CTL0_UPDIS                                 BIT(1)                            /*!< update event disable */
#define GPTIMER_CTL0_SPM                                   BIT(3)                            /*!< single pulse mode */
#define GPTIMER_CTL0_DIR                                   BIT(4)                            /*!< direction */
#define GPTIMER_CTL0_FDIR                                  BIT(5)                            /*!< force the counting direction */
#define GPTIMER_CTL0_CAM                                   BIT(6)                            /*!< counter align mode selection */
#define GPTIMER_CTL0_ARSE                                  BIT(7)                            /*!< auto-reload shadow enable */
#define GPTIMER_CTL0_CKDIV                                 BITS(8,9)                         /*!< clock division */
#define GPTIMER_CTL0_CCSOEN                                BIT(16)                           /*!< the counter cycle synchronization signal output enable */
#define GPTIMER_CTL0_CKSSEL                                BITS(24,26)                       /*!< clock source selection */
#define GPTIMER_CTL0_CKESEL                                BITS(28,29)                       /*!< effective edge selection when ETIx(x = 0, 1, 2, 3) is selected as the clock */

/* GPTIMER_CUPEVSSEL */
#define GPTIMER_CUPEVSSEL_ETI0CUPS                         BITS(0,1)                         /*!< the ETI0 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_ETI1CUPS                         BITS(2,3)                         /*!< the ETI1 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_ETI2CUPS                         BITS(4,5)                         /*!< the ETI2 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_ETI3CUPS                         BITS(6,7)                         /*!< the ETI3 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_CH0CUPS                          BITS(8,9)                         /*!< the channel 0 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_CH1CUPS                          BITS(10,11)                       /*!< the channel 1 signal edge as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL0CUPS                       BIT(16)                           /*!< the EVSEL0 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL1CUPS                       BIT(17)                           /*!< the EVSEL1 signal as the count up event source function enablee */
#define GPTIMER_CUPEVSSEL_EVSEL2CUPS                       BIT(18)                           /*!< the EVSEL2 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL3CUPS                       BIT(19)                           /*!< the EVSEL3 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL4CUPS                       BIT(20)                           /*!< the EVSEL4 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL5CUPS                       BIT(21)                           /*!< the EVSEL5 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL6CUPS                       BIT(22)                           /*!< the EVSEL6 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_EVSEL7CUPS                       BIT(23)                           /*!< the EVSEL7 signal as the count up event source function enable */
#define GPTIMER_CUPEVSSEL_INTLCUPS                         BITS(24,27)                       /*!< The input level as the count up event source function enable */

/* GPTIMER_CDNEVSSEL */
#define GPTIMER_CDNEVSSEL_ETI0CDWS                         BITS(0,1)                         /*!< the ETI0 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_ETI1CDWS                         BITS(2,3)                         /*!< the ETI1 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_ETI2CDWS                         BITS(4,5)                         /*!< the ETI2 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_ETI3CDWS                         BITS(6,7)                         /*!< the ETI3 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_CH0CDWS                          BITS(8,9)                         /*!< the channel 0 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_CH1CDWS                          BITS(10,11)                       /*!< the channel 1 signal edge as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL0CDWS                       BIT(16)                           /*!< the EVSEL0 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL1CDWS                       BIT(17)                           /*!< the EVSEL1 signal as the count down event source function enablee */
#define GPTIMER_CDNEVSSEL_EVSEL2CDWS                       BIT(18)                           /*!< the EVSEL2 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL3CDWS                       BIT(19)                           /*!< the EVSEL3 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL4CDWS                       BIT(20)                           /*!< the EVSEL4 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL5CDWS                       BIT(21)                           /*!< the EVSEL5 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL6CDWS                       BIT(22)                           /*!< the EVSEL6 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_EVSEL7CDWS                       BIT(23)                           /*!< the EVSEL7 signal as the count down event source function enable */
#define GPTIMER_CDNEVSSEL_INTLCDWS                         BITS(24,27)                       /*!< The input level as the count down event source function enable */

