burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_CH0CTL */
#define GPTIMER_CH0CTL_CH0COMDW                            BITS(0,1)                         /*!< channel 0 compare match output level control when counter count down */
#define GPTIMER_CH0CTL_CH0COMUP                            BITS(2,3)                         /*!< channel 0 compare match output level control when counter count up */
#define GPTIMER_CH0CTL_CH0ACOMDW                           BITS(4,5)                         /*!< channel 0 additional compare match output level control when counter count down */
#define GPTIMER_CH0CTL_CH0ACOMUP                           BITS(6,7)                         /*!< channel 0 additional compare match output level control when counter count up */
#define GPTIMER_CH0CTL_CH0EFF                              BIT(8)                            /*!< channel 0 output control in invalid or not when the end of the cycle and comparison match occur simultaneously */
#define GPTIMER_CH0CTL_CH0OUTM                             BITS(12,13)                       /*!< channel 0 output mode */
#define GPTIMER_CH0CTL_CH0OUTCTL                           BIT(14)                           /*!< channel 0 output control setting */
#define GPTIMER_CH0CTL_CH0REDUTY                           BIT(15)                           /*!< channel 0 output level selection when counter release from 0% or 100% duty */
#define GPTIMER_CH0CTL_CH0ENDOUT                           BITS(16,17)                       /*!< channel 0 output level selection at the end of the period */
#define GPTIMER_CH0CTL_CH0ENOUT                            BIT(18)                           /*!< channel 0 output initial level selection when counter enable */
#define GPTIMER_CH0CTL_CH0DISOUT                           BIT(19)                           /*!< channel 0 output level selection when counter disable */
#define GPTIMER_CH0CTL_CH0OUT                              BIT(20)                           /*!< channel 0 output level selection when counter enable or disable */
#define GPTIMER_CH0CTL_CH0INVSOUT                          BITS(21,22)                       /*!< channel 0 invalid level setting when GTOC sends a stop output request */
#define GPTIMER_CH0CTL_CH0CAPPSC                           BITS(26,27)                       /*!< channel 0 input capture prescaler */
#define GPTIMER_CH0CTL_CH0CAPFLT                           BITS(28,31)                       /*!< channel 0 input capture filter control */

/* GPTIMER_CH1CTL */
#define GPTIMER_CH1CTL_CH1COMDW                            BITS(0,1)                         /*!< channel 1 compare match output level control when counter count down */
#define GPTIMER_CH1CTL_CH1COMUP                            BITS(2,3)                         /*!< channel 1 compare match output level control when counter count up */
#define GPTIMER_CH1CTL_CH1ACOMDW                           BITS(4,5)                         /*!< channel 1 additional compare match output level control when counter count down */
#define GPTIMER_CH1CTL_CH1ACOMUP                           BITS(6,7)                         /*!< channel 1 additional compare match output level control when counter count up */
#define GPTIMER_CH1CTL_CH1EFF                              BIT(8)                            /*!< channel 1 output control in invalid or not when the end of the cycle and comparison match occur simultaneously */
#define GPTIMER_CH1CTL_CH1OUTM                             BITS(12,13)                       /*!< channel 1 output mode */
#define GPTIMER_CH1CTL_CH1OUTCTL                           BIT(14)                           /*!< channel 1 output control setting */
#define GPTIMER_CH1CTL_CH1REDUTY                           BIT(15)                           /*!< channel 1 output level selection when counter release from 0% or 100% duty */
#define GPTIMER_CH1CTL_CH1ENDOUT                           BITS(16,17)                       /*!< channel 1 output level selection at the end of the period */
#define GPTIMER_CH1CTL_CH1ENOUT                            BIT(18)                           /*!< channel 1 output initial level selection when counter enable */
#define GPTIMER_CH1CTL_CH1DISOUT                           BIT(19)                           /*!< channel 1 output level selection when counter disable */
#define GPTIMER_CH1CTL_CH1OUT                              BIT(20)                           /*!< channel 1 output level selection when counter enable or disable */
#define GPTIMER_CH1CTL_CH1INVSOUT                          BITS(21,22)                       /*!< channel 1 invalid level setting when GTOC sends a stop output request */
#define GPTIMER_CH1CTL_CH1CAPPSC                           BITS(26,27)                       /*!< channel 1 input capture prescaler */
#define GPTIMER_CH1CTL_CH1CAPFLT                           BITS(28,31)                       /*!< channel 1 input capture filter control */

/* GPTIMER_CHCTL */
#define GPTIMER_CHCTL_CH0EN                                BIT(0)                            /*!< channel 0 capture/compare enable */
#define GPTIMER_CHCTL_CH0SEL                               BIT(1)                            /*!< channel 0 capture/compare select */
#define GPTIMER_CHCTL_CH0COMSEN                            BIT(4)                            /*!< channel 0 compare output shadow enable */
#define GPTIMER_CHCTL_CH0COMADDSEN                         BIT(5)                            /*!< channel 0 additional compare output shadow enable */
#define GPTIMER_CHCTL_CH0SEN                               BIT(6)                            /*!< channel 0 output shadow enable */
#define GPTIMER_CHCTL_CH1EN                                BIT(8)                            /*!< channel 1 capture/compare enable */
#define GPTIMER_CHCTL_CH1SEL                               BIT(9)                            /*!< channel 1 capture/compare selection */
#define GPTIMER_CHCTL_CH1COMSEN                            BIT(12)                           /*!< channel 1 compare output shadow enable */
#define GPTIMER_CHCTL_CH1COMADDSEN                         BIT(13)                           /*!< channel 1 additional compare output shadow enable */
#define GPTIMER_CHCTL_CH1SEN                               BIT(14)                           /*!< channel 1 output shadow enable */
#define GPTIMER_CHCTL_CH1MSEL                              BIT(16)                           /*!< channel 1 mode selection */
#define GPTIMER_CHCTL_DTEN                                 BIT(17)                           /*!< the insertion of the dead time enable */
#define GPTIMER_CHCTL_STORESEL                             BIT(20)                           /*!< stop output recovery time selection */

