burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_DMAINTEN */
#define GPTIMER_DMAINTEN_CH0IE                             BIT(0)                            /*!< channel 0 capture/compare interrupt enable */
#define GPTIMER_DMAINTEN_CH1IE                             BIT(1)                            /*!< channel 1 capture/compare interrupt enable */
#define GPTIMER_DMAINTEN_OFIE                              BIT(2)                            /*!< counter overflow interrupt enable */
#define GPTIMER_DMAINTEN_UFIE                              BIT(3)                            /*!< counter underflow interrupt enable */
#define GPTIMER_DMAINTEN_CH0COMADDIE                       BIT(4)                            /*!< channel 0 additional compare interrupt enable */
#define GPTIMER_DMAINTEN_CH1COMADDIE                       BIT(5)                            /*!< channel 1 additional compare interrupt enable */
#define GPTIMER_DMAINTEN_RSIE                              BIT(7)                            /*!< reset interrupt enable */
#define GPTIMER_DMAINTEN_CHHOUTDET                         BIT(13)                           /*!< channel 0 and channel 1 simultaneously output high level output off detection enable */
#define GPTIMER_DMAINTEN_CHLOUTDET                         BIT(14)                           /*!< channel 0 and channel 1 simultaneously output low level output off detection enable */
#define GPTIMER_DMAINTEN_RCENDIE                           BIT(15)                           /*!< repetition count end interrupt enable */
#define GPTIMER_DMAINTEN_CH0DEN                            BIT(16)                           /*!< channel 0 capture / compare DMA request enable */
#define GPTIMER_DMAINTEN_CH1DEN                            BIT(17)                           /*!< channel 1 capture / compare DMA request enable */
#define GPTIMER_DMAINTEN_OVUNDEN                           BITS(18,19)                       /*!< counter overflow / underflow DMA request enable */
#define GPTIMER_DMAINTEN_CH0COMADDEN                       BIT(20)                           /*!< channel 0 additional compare DMA request enable */
#define GPTIMER_DMAINTEN_CH1COMADDEN                       BIT(21)                           /*!< channel 1 additional compare DMA request enable */
#define GPTIMER_DMAINTEN_RCENDEN                           BIT(22)                           /*!< repetition count end DMA request enable */
#define GPTIMER_DMAINTEN_CLOSSEL                           BITS(24,25)                       /*!< closing output source selection from GTOC */

/* GPTIMER_INTF */
#define GPTIMER_INTF_CH0IF                                 BIT(0)                            /*!< channel 0 capture/compare interrupt flag */
#define GPTIMER_INTF_CH1IF                                 BIT(1)                            /*!< channel 1 capture/compare interrupt flag */
#define GPTIMER_INTF_OFIF                                  BIT(2)                            /*!< the counter overflow interrupt flag */
#define GPTIMER_INTF_UFIF                                  BIT(3)                            /*!< the counter underflow interrupt flag */
#define GPTIMER_INTF_CH0COMADDIF                           BIT(4)                            /*!< channel 0 additional compare interrupt flag */
#define GPTIMER_INTF_CH1COMADDIF                           BIT(5)                            /*!< channel 1 additional compare interrupt flag */
#define GPTIMER_INTF_RSIF                                  BIT(7)                            /*!< reset interrupt flag */
#define GPTIMER_INTF_ADT1CMUF                              BIT(8)                            /*!< ADTCV1[15:0] compare match (counting up only) flag */
#define GPTIMER_INTF_ADT1CMDF                              BIT(9)                            /*!< ADTCV1[15:0] compare match (counting down only) flag */
#define GPTIMER_INTF_ADT2CMUF                              BIT(10)                           /*!< ADTCV2[15:0] compare match (counting up only) flag */
#define GPTIMER_INTF_ADT2CMDF                              BIT(11)                           /*!< ADTCV2[15:0] compare match (counting down only) flag */
#define GPTIMER_INTF_CHHOUTF                               BIT(13)                           /*!< channel 0 and channel 1 simultaneously output high level flag */
#define GPTIMER_INTF_CHLOUTF                               BIT(14)                           /*!< channel 0 and channel 1 simultaneously output low level flag */
#define GPTIMER_INTF_RCENDIF                               BIT(15)                           /*!< repetition count end interrupt flag */
#define GPTIMER_INTF_DIRF                                  BIT(16)                           /*!< the counter direction flag */
#define GPTIMER_INTF_OSTF                                  BIT(24)                           /*!< output stop flag */

/* GPTIMER_UPSSEL */
#define GPTIMER_UPSSEL_CH0CVUPSEL                          BITS(0,1)                         /*!< channel 0 capture/compare value update mode selection */
#define GPTIMER_UPSSEL_CH0COMV_ADDUPSEL                    BITS(2,4)                         /*!< channel 0 additional comparison value update mode selection */
#define GPTIMER_UPSSEL_CH1CVUPSEL                          BITS(5,6)                         /*!< channel 1 capture/compare value update mode selection */
#define GPTIMER_UPSSEL_CH1COMV_ADDUPSEL                    BITS(7,9)                         /*!< channel 1 additional comparison value update mode selection */
#define GPTIMER_UPSSEL_ADCCR1UPSEL                         BITS(10,11)                       /*!< the ADC triggered comparison value 1 update mode selection */
#define GPTIMER_UPSSEL_ADCCR2UPSEL                         BITS(12,13)                       /*!< the ADC triggered comparison value 2 update mode selection */
#define GPTIMER_UPSSEL_CARUPSEL                            BITS(14,15)                       /*!< the counter auto reload value update mode selection, used to set when the counter auto reload value will be automatically overloaded */
#define GPTIMER_UPSSEL_GLBUPSEL                            BITS(16,17)                       /*!< global update mode update source selection */
#define GPTIMER_UPSSEL_CH0UPSEL                            BITS(24,25)                       /*!< channel 0 output mode update source selection */
#define GPTIMER_UPSSEL_CH1UPSEL                            BITS(26,27)                       /*!< channel 1 output mode update source selection */

/* GPTIMER_DTCTL */
#define GPTIMER_DTCTL_REDTCFG                              BITS(0,7)                         /*!< the rising edge dead time configuration */
#define GPTIMER_DTCTL_REDTSEN                              BIT(8)                            /*!< the rising edge dead time shadow register enable */
#define GPTIMER_DTCTL_FEDTCFG                              BITS(16,23)                       /*!< the falling edge dead time configuration */
#define GPTIMER_DTCTL_FEDTSEN                              BIT(24)                           /*!< the falling edge dead time shadow register is enabled */
#define GPTIMER_DTCTL_DTASYEN                              BIT(31)                           /*!< dead time asymmetric mode enable */

/* GPTIMER_ADCTL */
#define GPTIMER_ADCTL_ADTCV1SSEL                           BITS(0,2)                         /*!< the ADC conversion request skipping source selection and the trigger signal generated by ADTCV1[15:0] */
#define GPTIMER_ADCTL_ADTCV2SSEL                           BITS(4,6)                         /*!< the ADC conversion request skipping source selection and the trigger signal generated by ADTCV2[15:0] */
#define GPTIMER_ADCTL_ADTCV1SEN                            BIT(8)                            /*!< the ADTCV1[15:0] shadow register enable */
#define GPTIMER_ADCTL_ADTCV2SEN                            BIT(9)                            /*!< the ADTCV2[15:0] shadow register enable */
#define GPTIMER_ADCTL_ADT1UPGTEN                           BIT(12)                           /*!< the ADTCV1[15:0] comparison match (count up only) generate trigger enable */
#define GPTIMER_ADCTL_ADT1DWGTEN                           BIT(13)                           /*!< the ADTCV1[15:0] comparison match (count down only) generate trigger enable */
#define GPTIMER_ADCTL_ADT2UPGTEN                           BIT(14)                           /*!< the ADTCV2[15:0] comparison match (count up only) generate trigger enable */
#define GPTIMER_ADCTL_ADT2DWGTEN                           BIT(15)                           /*!< the ADTCV2[15:0] comparison match (count down only) generate trigger enable */
#define GPTIMER_ADCTL_ADCMS3SEL                            BIT(16)                           /*!< ADC triggers monitoring signal 3 selection */
#define GPTIMER_ADCTL_ADCMS3EN                             BIT(20)                           /*!< ADC triggers monitoring signal 3 enable */
#define GPTIMER_ADCTL_ADCMS4SEL                            BIT(24)                           /*!< ADC triggers monitoring signal 4 selection */
#define GPTIMER_ADCTL_ADCMS4EN                             BIT(28)                           /*!< ADC triggers monitoring signal 4 enable */

