burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_ADCTRGS */
#define GPTIMER_ADCTRGS_ADCC1SKSEL                         BITS(0,1)                         /*!< the ADC skipping counter 1 skipping source selection */
#define GPTIMER_ADCTRGS_ADCC1SVAL                          BITS(4,7)                         /*!< the ADC skipping counter 1 skipping value */
#define GPTIMER_ADCTRGS_ADCC1IVAL                          BITS(8,11)                        /*!< the ADC skipping counter 1 Initial value */
#define GPTIMER_ADCTRGS_ADCC1VAL                           BITS(12,15)                       /*!< this bit-field indicates the current ADC skipping counter 1 value */
#define GPTIMER_ADCTRGS_ADCC2SKSEL                         BITS(16,17)                       /*!< the ADC skipping counter 2 skipping source selection */
#define GPTIMER_ADCTRGS_ADCC2SVAL                          BITS(20,23)                       /*!< the ADC skipping counter 2 skipping value */
#define GPTIMER_ADCTRGS_ADCC2IVAL                          BITS(24,27)                       /*!< the ADC skipping counter 2 Initial value */
#define GPTIMER_ADCTRGS_ADCC2VAL                           BITS(28,31)                       /*!< this bit-field indicates the current ADC skipping counter 2 value */

/* GPTIMER_ADDINTSCTL0 */
#define GPTIMER_ADDINTSCTL0_ADDC1SKSEL                     BITS(0,1)                         /*!< the additional interrupt skipping counter 1 skipping source selection */
#define GPTIMER_ADDINTSCTL0_ADDC1SVAL                      BITS(4,7)                         /*!< the additional interrupt skipping counter 1 skipping value */
#define GPTIMER_ADDINTSCTL0_ADDC1IVAL                      BITS(8,11)                        /*!< the additional interrupt skipping counter 1 Initial value */
#define GPTIMER_ADDINTSCTL0_ADDC1VAL                       BITS(12,15)                       /*!< this bit-field indicates the current additional interrupt skipping counter 1 value*/
#define GPTIMER_ADDINTSCTL0_ADDC2SKSEL                     BITS(16,17)                       /*!< the additional interrupt skipping counter 2 skipping source selection */
#define GPTIMER_ADDINTSCTL0_ADDC2SVAL                      BITS(20,23)                       /*!< the additional interrupt skipping counter 2 skipping source selection */
#define GPTIMER_ADDINTSCTL0_ADDC2IVAL                      BITS(24,27)                       /*!< the additional interrupt skipping counter 2 Initial value */
#define GPTIMER_ADDINTSCTL0_ADDC2VAL                       BITS(28,31)                       /*!< this bit-field indicates the current additional interrupt skipping counter 2 value */

/* GPTIMER_ADDINTSCTL1 */
#define GPTIMER_ADDINTSCTL1_CH0AISSEL                      BITS(0,2)                         /*!< the channel 0 input capture/compare match additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_CH1AISSEL                      BITS(4,6)                         /*!< the channel 1 input capture/compare match additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_CH0ADDAISSEL                   BITS(8,10)                        /*!< the channel 0 additional value compare match additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_CH1ADDAISSEL                   BITS(12,14)                       /*!< the channel 1 additional value compare match additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_UFAISSEL                       BITS(16,18)                       /*!< underflow additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_OFAISSEL                       BITS(20,22)                       /*!< overflow additional interrupt skipping function selection */
#define GPTIMER_ADDINTSCTL1_ADT1AISSEL                     BITS(24,26)                       /*!< the trigger signal generated by ADTCV1[15:0] additional interrupt skipping function selectiont */
#define GPTIMER_ADDINTSCTL1_ADT2AISSEL                     BITS(28,30)                       /*!< the trigger signal generated by ADTCV2[15:0] additional interrupt skipping function selection */

/* GPTIMER_IADCTSS */
#define GPTIMER_IADCTSS_CH0INTSL                           BIT(0)                            /*!< the channel 0 input capture/compare match interrupt skipping link */
#define GPTIMER_IADCTSS_CH1INTSL                           BIT(1)                            /*!< the channel 1 input capture/compare match interrupt skipping link */
#define GPTIMER_IADCTSS_CH0AINTSL                          BIT(2)                            /*!< the channel 0 additional value compare match interrupt skipping link */
#define GPTIMER_IADCTSS_CH1AINTSL                          BIT(3)                            /*!< the channel 1 additional value compare match interrupt skipping link */
#define GPTIMER_IADCTSS_OUFINTSSEL                         BITS(4,5)                         /*!< overflow / underflow interrupt skip selection */
#define GPTIMER_IADCTSS_OUFINTSVAL                         BITS(8,10)                        /*!< the number of overflow / underflow interrupt skipping value */
#define GPTIMER_IADCTSS_ADT1INTSL                          BIT(12)                           /*!< the trigger signal generated by ADTCV1[15:0] interrupt skipping link */
#define GPTIMER_IADCTSS_ADT2INTSL                          BIT(13)                           /*!< the trigger signal generated by ADTCV2[15:0] interrupt skipping link */
#define GPTIMER_IADCTSS_OUFINTSC                           BITS(16,18)                       /*!< overflow / underflow interrupt skipping counter */

/* GPTIMER_CREP */
#define GPTIMER_CREP_CREP                                  BITS(0,11)                        /*!< counter repetition value */
#define GPTIMER_CREP_CNT                                   BITS(16,27)                       /*!< repeat counter current value */
#define GPTIMER_CREP_RLD                                   BIT(31)                           /*!< the repeat counter is loaded immediately */

