burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER_SYNRSTCTL */
#define GPTIMER_SYNRSTCTL_CH0RETEN                         BIT(0)                            /*!< channel 0 compare match / input capture as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_CH1RETEN                         BIT(1)                            /*!< channel 1 compare match / input capture as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_CH0ARETEN                        BIT(2)                            /*!< channel 0 additional value compare match as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_CH1ARETEN                        BIT(3)                            /*!< channel 1 additional value compare match as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_OVRETEN                          BIT(6)                            /*!< overflow as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_UNDRETEN                         BIT(7)                            /*!< underflow as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_CHSRETEN                         BIT(16)                           /*!< channel input as the other GPTIMER synchronization reset source enable */
#define GPTIMER_SYNRSTCTL_SYNCSSEL                         BIT(21)                           /*!< GPTIMER synchronization control set selection */

/* GPTIMER_DMACFG */
#define GPTIMER_DMACFG_DMATA                               BITS(0,5)                         /*!< DMA transfer access start address */
#define GPTIMER_DMACFG_DMATC                               BITS(8,13)                        /*!< DMA transfer count */

/* GPTIMER_DMATB */
#define GPTIMER_DMATB_DMATB                                BITS(0,15)                        /*!< DMA transfer buffer address */

/* GPTIMER_CFG */
#define GPTIMER_CFG_CHVSEL                                 BIT(1)                            /*!< write CHxVAL register selection */

/* constants definitions */
/* GPTIMER init parameter struct definitions */
typedef struct {
    uint32_t clock_source;                                                                   /*!< clock source */
    uint32_t clock_polarity;                                                                 /*!< clock polarity */
    uint32_t prescaler;                                                                      /*!< prescaler value */
    uint32_t alignedmode;                                                                    /*!< aligned mode */
    uint32_t counterdirection;                                                               /*!< counter direction */
    uint32_t period;                                                                         /*!< period value */
    uint32_t clockdivision;                                                                  /*!< clock division value */
    uint32_t repetitioncounter;                                                              /*!< the counter repetition value */
} gptimer_parameter_struct;

/* counter enable source parameter struct definitions */
typedef struct {
    uint32_t enable_source_eti0;                                                             /*!< eti0 as counter enable source */
    uint32_t enable_source_eti1;                                                             /*!< eti1 as counter enable source */
    uint32_t enable_source_eti2;                                                             /*!< eti2 as counter enable source */
    uint32_t enable_source_eti3;                                                             /*!< eti3 as counter enable source */
    uint32_t enable_source_ch0;                                                              /*!< channel 0 as counter enable source */
    uint32_t enable_source_ch1;                                                              /*!< channel 1 as counter enable source */
    uint32_t enable_source_evsel0;                                                           /*!< evsel0 as counter enable source */
    uint32_t enable_source_evsel1;                                                           /*!< evsel1 as counter enable source */
    uint32_t enable_source_evsel2;                                                           /*!< evsel2 as counter enable source */
    uint32_t enable_source_evsel3;                                                           /*!< evsel3 as counter enable source */
    uint32_t enable_source_evsel4;                                                           /*!< evsel4 as counter enable source */
    uint32_t enable_source_evsel5;                                                           /*!< evsel5 as counter enable source */
    uint32_t enable_source_evsel6;                                                           /*!< evsel6 as counter enable source */
    uint32_t enable_source_evsel7;                                                           /*!< evsel7 as counter enable source */
    uint32_t enable_source_software;                                                         /*!< software event as counter enable source */
} gptimer_counter_enable_source_parameter_struct;

/* counter disable source parameter struct definitions */
typedef struct {
    uint32_t disable_source_eti0;                                                            /*!< eti0 as counter disable source */
    uint32_t disable_source_eti1;                                                            /*!< eti1 as counter disable source */
    uint32_t disable_source_eti2;                                                            /*!< eti2 as counter disable source */
    uint32_t disable_source_eti3;                                                            /*!< eti3 as counter disable source */
    uint32_t disable_source_ch0;                                                             /*!< channel 0 as counter disable source */
    uint32_t disable_source_ch1;                                                             /*!< channel 1 as counter disable source */
    uint32_t disable_source_evsel0;                                                          /*!< evsel0 as counter disable source */
    uint32_t disable_source_evsel1;                                                          /*!< evsel1 as counter disable source */
    uint32_t disable_source_evsel2;                                                          /*!< evsel2 as counter disable source */
    uint32_t disable_source_evsel3;                                                          /*!< evsel3 as counter disable source */
    uint32_t disable_source_evsel4;                                                          /*!< evsel4 as counter disable source */
    uint32_t disable_source_evsel5;                                                          /*!< evsel5 as counter disable source */
    uint32_t disable_source_evsel6;                                                          /*!< evsel6 as counter disable source */
    uint32_t disable_source_evsel7;                                                          /*!< evsel7 as counter disable source */
    uint32_t disable_source_software;                                                        /*!< software event as counter disable source */
} gptimer_counter_disable_source_parameter_struct;

/* counter reset source parameter struct definitions */
typedef struct {
    uint32_t reset_source_eti0;                                                              /*!< eti0 as counter reset source */
    uint32_t reset_source_eti1;                                                              /*!< eti1 as counter reset source */
    uint32_t reset_source_eti2;                                                              /*!< eti2 as counter reset source */
    uint32_t reset_source_eti3;                                                              /*!< eti3 as counter reset source */
    uint32_t reset_source_ch0;                                                               /*!< channel 0 as counter reset source */
    uint32_t reset_source_ch1;                                                               /*!< channel 1 as counter reset source */
    uint32_t reset_source_evsel0;                                                            /*!< evsel0 as counter reset source */
    uint32_t reset_source_evsel1;                                                            /*!< evsel1 as counter reset source */
    uint32_t reset_source_evsel2;                                                            /*!< evsel2 as counter reset source */
    uint32_t reset_source_evsel3;                                                            /*!< evsel3 as counter reset source */
    uint32_t reset_source_evsel4;                                                            /*!< evsel4 as counter reset source */
    uint32_t reset_source_evsel5;                                                            /*!< evsel5 as counter reset source */
    uint32_t reset_source_evsel6;                                                            /*!< evsel6 as counter reset source */
    uint32_t reset_source_evsel7;                                                            /*!< elcn as counter reset source */
    uint32_t reset_source_com_cap_sync;                                                      /*!< copmare, capture or synchronous reset event as counter reset source */
    uint32_t reset_source_software;                                                          /*!< software event counter reset source */
} gptimer_counter_reset_source_parameter_struct;

/* channel capture source parameter struct definitions */
typedef struct {
    uint32_t capture_source_eti0;                                                            /*!< eti0 as capture source */
    uint32_t capture_source_eti1;                                                            /*!< eti1 as capture source */
    uint32_t capture_source_eti2;                                                            /*!< eti2 as capture source */
    uint32_t capture_source_eti3;                                                            /*!< eti3 as capture source */
    uint32_t capture_source_ch0;                                                             /*!< channel 0 as capture source */
    uint32_t capture_source_ch1;                                                             /*!< channel 1 as capture source */
    uint32_t capture_source_evsel0;                                                          /*!< evsel0 as capture source */
    uint32_t capture_source_evsel1;                                                          /*!< evsel1 as capture source */
    uint32_t capture_source_evsel2;                                                          /*!< evsel2 as capture source */
    uint32_t capture_source_evsel3;                                                          /*!< evsel3 as capture source */
    uint32_t capture_source_evsel4;                                                          /*!< evsel4 as capture source */
    uint32_t capture_source_evsel5;                                                          /*!< evsel5 as capture source */
    uint32_t capture_source_evsel6;                                                          /*!< evsel6 as capture source */
    uint32_t capture_source_evsel7;                                                          /*!< evsel7 as capture source */
} gptimer_capture_source_parameter_struct;

