burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* counter count up source parameter struct definitions */
typedef struct {
    uint32_t up_count_source_eti0;                                                           /*!< eti0 as up count source */
    uint32_t up_count_source_eti1;                                                           /*!< eti1 as up count source */
    uint32_t up_count_source_eti2;                                                           /*!< eti2 as up count source */
    uint32_t up_count_source_eti3;                                                           /*!< eti3 as up count source */
    uint32_t up_count_source_ch0;                                                            /*!< channel 0 as up count source */
    uint32_t up_count_source_ch1;                                                            /*!< channel 1 as up count source */
    uint32_t up_count_source_evsel0;                                                         /*!< evsel0 as up count source */
    uint32_t up_count_source_evsel1;                                                         /*!< evsel1 as up count source */
    uint32_t up_count_source_evsel2;                                                         /*!< evsel2 as up count source */
    uint32_t up_count_source_evsel3;                                                         /*!< evsel3 as up count source */
    uint32_t up_count_source_evsel4;                                                         /*!< evsel4 as up count source */
    uint32_t up_count_source_evsel5;                                                         /*!< evsel5 as up count source */
    uint32_t up_count_source_evsel6;                                                         /*!< evsel6 as up count source */
    uint32_t up_count_source_evsel7;                                                         /*!< evsel7 as up count source */
} gptimer_counter_up_source_parameter_struct;

/* counter count down source parameter struct definitions */
typedef struct {
    uint32_t down_count_source_eti0;                                                         /*!< eti0 as down count source */
    uint32_t down_count_source_eti1;                                                         /*!< eti1 as down count source */
    uint32_t down_count_source_eti2;                                                         /*!< eti2 as down count source */
    uint32_t down_count_source_eti3;                                                         /*!< eti3 as down count source */
    uint32_t down_count_source_ch0;                                                          /*!< channel 0 as down count source */
    uint32_t down_count_source_ch1;                                                          /*!< channel 1 as down count source */
    uint32_t down_count_source_evsel0;                                                       /*!< evsel0 as down count source */
    uint32_t down_count_source_evsel1;                                                       /*!< evsel1 as down count source */
    uint32_t down_count_source_evsel2;                                                       /*!< evsel2 as down count source */
    uint32_t down_count_source_evsel3;                                                       /*!< evsel3 as down count source */
    uint32_t down_count_source_evsel4;                                                       /*!< evsel4 as down count source */
    uint32_t down_count_source_evsel5;                                                       /*!< evsel5 as down count source */
    uint32_t down_count_source_evsel6;                                                       /*!< evsel6 as down count source */
    uint32_t down_count_source_evsel7;                                                       /*!< evsel7 as down count source */
} gptimer_counter_down_source_parameter_struct;

/* channel output parameter struct definitions */
typedef struct {
    uint32_t chxcv_up_output_level;                                                          /*!< up count chxcv match output level */
    uint32_t chxcv_down_output_level;                                                        /*!< down count chxcv match output level */
    uint32_t chxcomv_add_up_output_level;                                                    /*!< up count chxcomv_add match output level */
    uint32_t chxcomv_add_down_output_level;                                                  /*!< down count chxcomv_add match output level */
    uint32_t period_end_output_level;                                                        /*!< period end output level */
    uint32_t cnt_enable_disable_oc_en;                                                       /*!< counter start or stop output control enable */
    uint32_t cnt_enable_output_level;                                                        /*!< counter enable output initial level */
    uint32_t cnt_disable_output_level;                                                       /*!< counter disable output level */
    uint32_t output_stop_output_level;                                                       /*!< output stop output level */
    uint32_t force_duty_output_mode;                                                         /*!< force duty output mode */
    uint32_t force_duty_output_time;                                                         /*!< force duty output time */
    uint32_t force_duty_end_output_level;                                                    /*!< force duty end output level */
    uint32_t compare_period_end_priority_control;                                            /*!< compare match and period end priority control */
} gptimer_oc_parameter_struct;

/* channel complementary output output parameter struct definitions */
typedef struct {
    uint32_t complementary_mode;                                                             /*!< complementary output mode */
    uint32_t deadtime_enable;                                                                /*!< deadtime enable */
    uint32_t deadtime_mode;                                                                  /*!< deadtime mode */
    uint32_t rising_deadtime_value;                                                          /*!< rising edge deadtime value */
    uint32_t falling_deadtime_value;                                                         /*!< falling edge deadtime value */
    uint32_t rising_deadtime_shadow;                                                         /*!< rising edge deadtime shadow */
    uint32_t falling_deadtime_shadow;                                                        /*!< falling edge deadtime shadow */
} gptimer_com_oc_parameter_struct;


#define GPTIMER0_COUNT                                     BIT(0)                            /*!< GPTIMER0 counter */
#define GPTIMER1_COUNT                                     BIT(1)                            /*!< GPTIMER1 counter */

#define GPTIMER_WRITE_PROTECT_SWEN                         GPTIMER_WP_SWEWPEN                /*!< GPTIMER_SWEN register writer protect */
#define GPTIMER_WRITE_PROTECT_SWDIS                        GPTIMER_WP_SWDWPEN                /*!< GPTIMER_SWDIS register writer protect */
#define GPTIMER_WRITE_PROTECT_SWRST                        GPTIMER_WP_SWRWPEN                /*!< GPTIMER_SWRST register writer protect */
#define GPTIMER_WRITE_PROTECT_OTHER                        GPTIMER_WP_WPEN                   /*!< other register writer protect */

#define CLOCK_SOURCE_SELECT(regval)                        ((uint32_t)(BITS(24, 26) & ((uint32_t)(regval) << 24U)))
#define GPTIMER_CLOCK_SOURCE_CK_GPTIMER                    CLOCK_SOURCE_SELECT(0)            /*!< select CK_GPTIMER as clock source */
#define GPTIMER_CLOCK_SOURCE_ETI0                          CLOCK_SOURCE_SELECT(1)            /*!< select ETI0 as clock source */
#define GPTIMER_CLOCK_SOURCE_ETI1                          CLOCK_SOURCE_SELECT(2)            /*!< select ETI1 as clock source */
#define GPTIMER_CLOCK_SOURCE_ETI2                          CLOCK_SOURCE_SELECT(3)            /*!< select ETI2 as clock source */
#define GPTIMER_CLOCK_SOURCE_ETI3                          CLOCK_SOURCE_SELECT(4)            /*!< select ETI3 as clock source */

#define CLOCK_POLARITY_SELECT(regval)                      ((uint32_t)(BITS(28, 29) & ((uint32_t)(regval) << 28U)))
#define GPTIMER_CLOCK_POLARITY_RISING                      CLOCK_POLARITY_SELECT(0)          /*!< select rising edge as clock polarity */
#define GPTIMER_CLOCK_POLARITY_FALLING                     CLOCK_POLARITY_SELECT(1)          /*!< select falling edge as clock polarity */
#define GPTIMER_CLOCK_POLARITY_BOTH                        CLOCK_POLARITY_SELECT(2)          /*!< select both edge as clock polarity */

