burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
#define ETI0_TRG_EGDE(regval)                              ((uint32_t)(BITS(0, 1) & ((uint32_t)(regval) << 0U)))
#define GPTIMER_ETI0_TRG_DISABLE                           ETI0_TRG_EGDE(0)                  /*!< eti0 as trg source disable */
#define GPTIMER_ETI0_TRG_EDGE_RISING                       ETI0_TRG_EGDE(1)                  /*!< select eti0 rising edge as trg source */
#define GPTIMER_ETI0_TRG_EDGE_FALLING                      ETI0_TRG_EGDE(2)                  /*!< select eti0 falling edge as trg source */
#define GPTIMER_ETI0_TRG_EDGE_BOTH                         ETI0_TRG_EGDE(3)                  /*!< select eti0 both edge as trg source */

#define ETI1_TRG_EGDE(regval)                              ((uint32_t)(BITS(2, 3) & ((uint32_t)(regval) << 2U)))
#define GPTIMER_ETI1_TRG_DISABLE                           ETI1_TRG_EGDE(0)                  /*!< eti1 as trg source disable */
#define GPTIMER_ETI1_TRG_EDGE_RISING                       ETI1_TRG_EGDE(1)                  /*!< select eti1 rising edge as trg source */
#define GPTIMER_ETI1_TRG_EDGE_FALLING                      ETI1_TRG_EGDE(2)                  /*!< select eti1 falling edge as trg source */
#define GPTIMER_ETI1_TRG_EDGE_BOTH                         ETI1_TRG_EGDE(3)                  /*!< select eti1 both edge as trg source */

#define ETI2_TRG_EGDE(regval)                              ((uint32_t)(BITS(4, 5) & ((uint32_t)(regval) <<4U)))
#define GPTIMER_ETI2_TRG_DISABLE                           ETI2_TRG_EGDE(0)                  /*!< eti2 as trg source disable */
#define GPTIMER_ETI2_TRG_EDGE_RISING                       ETI2_TRG_EGDE(1)                  /*!< select eti2 rising edge as trg source */
#define GPTIMER_ETI2_TRG_EDGE_FALLING                      ETI2_TRG_EGDE(2)                  /*!< select eti2 falling edge as trg source */
#define GPTIMER_ETI2_TRG_EDGE_BOTH                         ETI2_TRG_EGDE(3)                  /*!< select eti2 both edge as trg source */

#define ETI3_TRG_EGDE(regval)                              ((uint32_t)(BITS(6, 7) & ((uint32_t)(regval) << 6U)))
#define GPTIMER_ETI3_TRG_DISABLE                           ETI3_TRG_EGDE(0)                  /*!< eti3 as trg source disable */
#define GPTIMER_ETI3_TRG_EDGE_RISING                       ETI3_TRG_EGDE(1)                  /*!< select eti3 rising edge as trg source */
#define GPTIMER_ETI3_TRG_EDGE_FALLING                      ETI3_TRG_EGDE(2)                  /*!< select eti3 falling edge as trg source */
#define GPTIMER_ETI3_TRG_EDGE_BOTH                         ETI3_TRG_EGDE(3)                  /*!< select eti3 both edge as trg source */

#define CH0_TRG_EGDE(regval)                               ((uint32_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))
#define GPTIMER_CH0_TRG_DISABLE                            CH0_TRG_EGDE(0)                   /*!< channel 0 as trg source disable */
#define GPTIMER_CH0_TRG_EDGE_RISING                        CH0_TRG_EGDE(1)                   /*!< select channel 0 rising edge as trg source */
#define GPTIMER_CH0_TRG_EDGE_FALLING                       CH0_TRG_EGDE(2)                   /*!< select channel 0 falling edge as trg source */
#define GPTIMER_CH0_TRG_EDGE_BOTH                          CH0_TRG_EGDE(3)                   /*!< select channel 0 both edge as trg source */

#define CH1_TRG_EGDE(regval)                               ((uint32_t)(BITS(10, 11) & ((uint32_t)(regval) << 10U)))
#define GPTIMER_CH1_TRG_DISABLE                            CH1_TRG_EGDE(0)                   /*!< channel 1 as trg source disable */
#define GPTIMER_CH1_TRG_EDGE_RISING                        CH1_TRG_EGDE(1)                   /*!< select channel 1 rising edge as trg source */
#define GPTIMER_CH1_TRG_EDGE_FALLING                       CH1_TRG_EGDE(2)                   /*!< select channel 1 falling edge as trg source */
#define GPTIMER_CH1_TRG_EDGE_BOTH                          CH1_TRG_EGDE(3)                   /*!< select channel 1 both edge as trg source */

#define GPTIMER_EVSEL0_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL0 as trg source disable */
#define GPTIMER_EVSEL0_TRG_ENABLE                          BIT(16)                           /*!< EVSEL0 as trg source */

#define GPTIMER_EVSEL1_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL1 as trg source disable */
#define GPTIMER_EVSEL1_TRG_ENABLE                          BIT(17)                           /*!< EVSEL1 as trg source */

#define GPTIMER_EVSEL2_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL2 as trg source disable */
#define GPTIMER_EVSEL2_TRG_ENABLE                          BIT(18)                           /*!< EVSEL2 as trg source */

#define GPTIMER_EVSEL3_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL3 as trg source disable */
#define GPTIMER_EVSEL3_TRG_ENABLE                          BIT(19)                           /*!< EVSEL3 as trg source */

#define GPTIMER_EVSEL4_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL4 as trg source disable */
#define GPTIMER_EVSEL4_TRG_ENABLE                          BIT(20)                           /*!< EVSEL4 as trg source */

#define GPTIMER_EVSEL5_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL5 as trg source disable */
#define GPTIMER_EVSEL5_TRG_ENABLE                          BIT(21)                           /*!< EVSEL5 as trg source */

#define GPTIMER_EVSEL6_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL6 as trg source disable */
#define GPTIMER_EVSEL6_TRG_ENABLE                          BIT(22)                           /*!< EVSEL6 as trg source */

#define GPTIMER_EVSEL7_TRG_DISABLE                         (uint32_t)0x00000000U             /*!< EVSEL7 as trg source disable */
#define GPTIMER_EVSEL7_TRG_ENABLE                          BIT(23)                           /*!< EVSEL7 as trg source */

#define GPTIMER_SOFTWARE_TRG_DISABLE                       (uint32_t)0x00000000U             /*!< software event as trg source disable */
#define GPTIMER_SOFTWARE_TRG_ENABLE                        BIT(31)                           /*!< software event as trg source */

#define RESET_SOURCE(regval)                               ((uint32_t)(BITS(24, 26) & ((uint32_t)(regval) << 24U)))
#define GPTIMER_RESET_SOURCE_DISABLE                       RESET_SOURCE(0)                   /*!< counter reset source disable */
#define GPTIMER_RESET_SOURCE_CH1CV_CMP_CAP                 RESET_SOURCE(1)                   /*!< ch1cv compare or capture as counter reset source enable */
#define GPTIMER_RESET_SOURCE_CH0CV_CMP_CAP                 RESET_SOURCE(2)                   /*!< ch0cv compare or capture as counter reset source enable */
#define GPTIMER_RESET_SOURCE_CH1COMADD_CMP                 RESET_SOURCE(3)                   /*!< ch1comval_add compare as counter reset source enable */
#define GPTIMER_RESET_SOURCE_CH0COMADD_CMP                 RESET_SOURCE(4)                   /*!< ch0comval_add compare as counter reset source enable */
#define GPTIMER_RESET_SOURCE_SYNC_RESET                    RESET_SOURCE(5)                   /*!< sync reset as counter reset source enable */

#define COUNTER_UP_INPUT_SOURCE(regval)                    ((uint32_t)(BITS(24, 27) & ((uint32_t)(regval) << 24U)))
#define GPTIMER_COUNTER_UP_DISABLE                         COUNTER_UP_INPUT_SOURCE(0)        /*!< counter up input source disable */
#define GPTIMER_COUNTER_UP_CH0_LOW                         COUNTER_UP_INPUT_SOURCE(2)        /*!< channel 0 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_CH0_HIGH                        COUNTER_UP_INPUT_SOURCE(3)        /*!< channel 0 high as counter up input source enable */
#define GPTIMER_COUNTER_UP_CH1_LOW                         COUNTER_UP_INPUT_SOURCE(4)        /*!< channel 1 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_CH1_HIGH                        COUNTER_UP_INPUT_SOURCE(5)        /*!< channel 1 high as counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI0_LOW                        COUNTER_UP_INPUT_SOURCE(8)        /*!< eti0 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI0_HIGH                       COUNTER_UP_INPUT_SOURCE(9)        /*!< eti0 high counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI1_LOW                        COUNTER_UP_INPUT_SOURCE(10)       /*!< eti1 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI1_HIGH                       COUNTER_UP_INPUT_SOURCE(11)       /*!< eti1 high counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI2_LOW                        COUNTER_UP_INPUT_SOURCE(12)       /*!< eti2 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI2_HIGH                       COUNTER_UP_INPUT_SOURCE(13)       /*!< eti2 high counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI3_LOW                        COUNTER_UP_INPUT_SOURCE(14)       /*!< eti3 low as counter up input source enable */
#define GPTIMER_COUNTER_UP_ETI3_HIGH                       COUNTER_UP_INPUT_SOURCE(15)       /*!< eti3 high counter up input source enable */

#define COUNTER_DOWN_INPUT_SOURCE(regval)                  ((uint32_t)(BITS(24, 27) & ((uint32_t)(regval) << 24U)))
#define GPTIMER_COUNTER_DOWN_DISABLE                       COUNTER_DOWN_INPUT_SOURCE(0)      /*!< counter down input source disable */
#define GPTIMER_COUNTER_DOWN_CH0_LOW                       COUNTER_DOWN_INPUT_SOURCE(2)      /*!< channel 0 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_CH0_HIGH                      COUNTER_DOWN_INPUT_SOURCE(3)      /*!< channel 0 high as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_CH1_LOW                       COUNTER_DOWN_INPUT_SOURCE(4)      /*!< channel 1 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_CH1_HIGH                      COUNTER_DOWN_INPUT_SOURCE(5)      /*!< channel 1 high as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI0_LOW                      COUNTER_DOWN_INPUT_SOURCE(8)      /*!< eti0 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI0_HIGH                     COUNTER_DOWN_INPUT_SOURCE(9)      /*!< eti0 high counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI1_LOW                      COUNTER_DOWN_INPUT_SOURCE(10)     /*!< eti1 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI1_HIGH                     COUNTER_DOWN_INPUT_SOURCE(11)     /*!< eti1 high counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI2_LOW                      COUNTER_DOWN_INPUT_SOURCE(12)     /*!< eti2 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI2_HIGH                     COUNTER_DOWN_INPUT_SOURCE(13)     /*!< eti2 high counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI3_LOW                      COUNTER_DOWN_INPUT_SOURCE(14)     /*!< eti3 low as counter down input source enable */
#define GPTIMER_COUNTER_DOWN_ETI3_HIGH                     COUNTER_DOWN_INPUT_SOURCE(15)     /*!< eti3 high counter down input source enable */

