burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER interrupt enable or disable */
#define GPTIMER_INT_CH0                                    GPTIMER_DMAINTEN_CH0IE            /*!< channel 0 compare or capture interrupt */
#define GPTIMER_INT_CH1                                    GPTIMER_DMAINTEN_CH1IE            /*!< channel 1 compare or capture interrupt */
#define GPTIMER_INT_OVERFLOW                               GPTIMER_DMAINTEN_OFIE             /*!< counter overflow interrupt */
#define GPTIMER_INT_UNDERFLOW                              GPTIMER_DMAINTEN_UFIE             /*!< counter underflow interrupt */
#define GPTIMER_INT_CH0COMADD                              GPTIMER_DMAINTEN_CH0COMADDIE      /*!< channel 0 additional compare interrupt */
#define GPTIMER_INT_CH1COMADD                              GPTIMER_DMAINTEN_CH1COMADDIE      /*!< channel 1 additional compare interrupt */
#define GPTIMER_INT_RS                                     GPTIMER_DMAINTEN_RSIE             /*!< counter reset interrupt */
#define GPTIMER_INT_CREP                                   GPTIMER_DMAINTEN_RCENDIE          /*!< repetition count end interrupt */

/* GPTIMER interrupt flag */
#define GPTIMER_INT_FLAG_CH0                               GPTIMER_INT_CH0                   /*!< channel 0 compare or capture interrupt flag */
#define GPTIMER_INT_FLAG_CH1                               GPTIMER_INT_CH1                   /*!< channel 1 compare or capture interrupt flag */
#define GPTIMER_INT_FLAG_OVERFLOW                          GPTIMER_INT_OVERFLOW              /*!< counter overflow interrupt flag */
#define GPTIMER_INT_FLAG_UNDERFLOW                         GPTIMER_INT_UNDERFLOW             /*!< counter underflow interrupt flag */
#define GPTIMER_INT_FLAG_CH0COMADD                         GPTIMER_INT_CH0COMADD             /*!< channel 0 additional compare interrupt flag */
#define GPTIMER_INT_FLAG_CH1COMADD                         GPTIMER_INT_CH1COMADD             /*!< channel 1 additional compare interrupt flag */
#define GPTIMER_INT_FLAG_RS                                GPTIMER_INT_RS                    /*!< counter reset interrupt flag */
#define GPTIMER_INT_FLAG_CREP                              GPTIMER_INT_CREP                  /*!< repetition count end interrupt flag */

/* GPTIMER flag */
#define GPTIMER_FLAG_CH0                                   GPTIMER_INTF_CH0IF                /*!< channel 0 compare or capture flag */
#define GPTIMER_FLAG_CH1                                   GPTIMER_INTF_CH1IF                /*!< channel 1 compare or capture flag */
#define GPTIMER_FLAG_OVERFLOW                              GPTIMER_INTF_OFIF                 /*!< counter overflow flag */
#define GPTIMER_FLAG_UNDERFLOW                             GPTIMER_INTF_UFIF                 /*!< counter underflow flag */
#define GPTIMER_FLAG_CH0COMADD                             GPTIMER_INTF_CH0COMADDIF          /*!< channel 0 additional compare or capture flag */
#define GPTIMER_FLAG_CH1COMADD                             GPTIMER_INTF_CH1COMADDIF          /*!< channel 1 additional compare or capture flag */
#define GPTIMER_FLAG_RS                                    GPTIMER_INTF_RSIF                 /*!< counter reset flag */
#define GPTIMER_FLAG_ADT1CMU                               GPTIMER_INTF_ADT1CMUF             /*!< counter up adc ADTCV1 match flag */
#define GPTIMER_FLAG_ADT1CMD                               GPTIMER_INTF_ADT1CMDF             /*!< counter down adc ADTCV1 match flag */
#define GPTIMER_FLAG_ADT2CMU                               GPTIMER_INTF_ADT2CMUF             /*!< counter up adc ADTCV2 match flag */
#define GPTIMER_FLAG_ADT2CMD                               GPTIMER_INTF_ADT2CMDF             /*!< counter down adc ADTCV2 match flag */
#define GPTIMER_FLAG_CHHOUT                                GPTIMER_INTF_CHHOUTF              /*!< two channel both output high flag */
#define GPTIMER_FLAG_CHLOUT                                GPTIMER_INTF_CHLOUTF              /*!< two channel both output low flag */
#define GPTIMER_FLAG_RCEND                                 GPTIMER_INTF_RCENDIF              /*!< repetition count end flag */
#define GPTIMER_FLAG_DIR                                   GPTIMER_INTF_DIRF                 /*!< counter diretion flag */
#define GPTIMER_FLAG_OST                                   GPTIMER_INTF_OSTF                 /*!< output stop flag */

/* GPTIMER DMA source */
#define GPTIMER_DMA_CH0D                                   GPTIMER_DMAINTEN_CH0DEN           /*!< channel 0 capture or compare DMA request */
#define GPTIMER_DMA_CH1D                                   GPTIMER_DMAINTEN_CH1DEN           /*!< channel 1 capture or compare DMA request */
#define GPTIMER_DMA_CH0COMADD                              GPTIMER_DMAINTEN_CH0COMADDEN      /*!< channel 0 additional compare DMA request */
#define GPTIMER_DMA_CH1COMADD                              GPTIMER_DMAINTEN_CH1COMADDEN      /*!< channel 1 additional compare DMA request */
#define GPTIMER_DMA_REPED                                  GPTIMER_DMAINTEN_RCENDEN          /*!< repetition count end DMA request */
#define GPTIMER_DMA_SOURCE(regval)                         (BITS(18, 19) & ((uint32_t)(regval) << 18U))
#define GPTIMER_DMA_OVERFLOWD                              GPTIMER_DMA_SOURCE(1)             /*!< counter overflow DMA request */
#define GPTIMER_DMA_UNDERFLOWD                             GPTIMER_DMA_SOURCE(2)             /*!< counter underflow DMA request */
#define GPTIMER_DMA_OVUNFLOWD                              GPTIMER_DMA_SOURCE(3)             /*!< counter overflow/underflow DMA request */

/* DMA access base address */
#define GPTIMER_DMATA(regval)                              (BITS(0, 5) & ((uint32_t)(regval) << 0U))
#define GPTIMER_DMACFG_DMATA_WP                            GPTIMER_DMATA(0)                  /*!< DMA transfer address is GPTIMER_WP */
#define GPTIMER_DMACFG_DMATA_SWEN                          GPTIMER_DMATA(1)                  /*!< DMA transfer address is GPTIMER_SWEN */
#define GPTIMER_DMACFG_DMATA_SWDIS                         GPTIMER_DMATA(2)                  /*!< DMA transfer address is GPTIMER_SWDIS */
#define GPTIMER_DMACFG_DMATA_SWRST                         GPTIMER_DMATA(3)                  /*!< DMA transfer address is GPTIMER_SWRST */
#define GPTIMER_DMACFG_DMATA_ESSEL                         GPTIMER_DMATA(4)                  /*!< DMA transfer address is GPTIMER_ESSEL */
#define GPTIMER_DMACFG_DMATA_DSSEL                         GPTIMER_DMATA(5)                  /*!< DMA transfer address is GPTIMER_DSSEL */
#define GPTIMER_DMACFG_DMATA_RSSEL                         GPTIMER_DMATA(6)                  /*!< DMA transfer address is GPTIMER_RSSEL */
#define GPTIMER_DMACFG_DMATA_CH0CSSEL                      GPTIMER_DMATA(7)                  /*!< DMA transfer address is GPTIMER_CH0CSSEL */
#define GPTIMER_DMACFG_DMATA_CH1CSSEL                      GPTIMER_DMATA(8)                  /*!< DMA transfer address is GPTIMER_CH1CSSEL */
#define GPTIMER_DMACFG_DMATA_CTL1                          GPTIMER_DMATA(9)                  /*!< DMA transfer address is GPTIMER_CTL0 */
#define GPTIMER_DMACFG_DMATA_UPSSR                         GPTIMER_DMATA(10)                 /*!< DMA transfer address is GPTIMER_CUPEVSSEL */
#define GPTIMER_DMACFG_DMATA_DNSSR                         GPTIMER_DMATA(11)                 /*!< DMA transfer address is GPTIMER_CDNEVSSEL */
#define GPTIMER_DMACFG_DMATA_CH0CTL                        GPTIMER_DMATA(12)                 /*!< DMA transfer address is GPTIMER_CH0CTL */
#define GPTIMER_DMACFG_DMATA_CH1CTL                        GPTIMER_DMATA(13)                 /*!< DMA transfer address is GPTIMER_CH1CTL */
#define GPTIMER_DMACFG_DMATA_CHCTL                         GPTIMER_DMATA(14)                 /*!< DMA transfer address is GPTIMER_CHCTL */
#define GPTIMER_DMACFG_DMATA_DMAINTEN                      GPTIMER_DMATA(15)                 /*!< DMA transfer address is GPTIMER_DMAINTEN */
#define GPTIMER_DMACFG_DMATA_INTF                          GPTIMER_DMATA(16)                 /*!< DMA transfer address is GPTIMER_INTF */
#define GPTIMER_DMACFG_DMATA_UPSSEL                        GPTIMER_DMATA(17)                 /*!< DMA transfer address is GPTIMER_UPSSEL */
#define GPTIMER_DMACFG_DMATA_CNT                           GPTIMER_DMATA(18)                 /*!< DMA transfer address is GPTIMER_CNT */
#define GPTIMER_DMACFG_DMATA_PSC                           GPTIMER_DMATA(19)                 /*!< DMA transfer address is GPTIMER_PSC */
#define GPTIMER_DMACFG_DMATA_CAR                           GPTIMER_DMATA(20)                 /*!< DMA transfer address is GPTIMER_CAR */
#define GPTIMER_DMACFG_DMATA_CH0CV                         GPTIMER_DMATA(21)                 /*!< DMA transfer address is GPTIMER_CH0CV */
#define GPTIMER_DMACFG_DMATA_CH1CV                         GPTIMER_DMATA(22)                 /*!< DMA transfer address is GPTIMER_CH1CV */
#define GPTIMER_DMACFG_DMATA_CH0COMV_ADD                   GPTIMER_DMATA(23)                 /*!< DMA transfer address is GPTIMER_CH0COMV_ADD */
#define GPTIMER_DMACFG_DMATA_CH1COMV_ADD                   GPTIMER_DMATA(24)                 /*!< DMA transfer address is GPTIMER_CH1COMV_ADD */
#define GPTIMER_DMACFG_DMATA_DTCTL                         GPTIMER_DMATA(25)                 /*!< DMA transfer address is GPTIMER_DTCTL */
#define GPTIMER_DMACFG_DMATA_ADCTL                         GPTIMER_DMATA(26)                 /*!< DMA transfer address is GPTIMER_ADCTL */
#define GPTIMER_DMACFG_DMATA_ADCCR1                        GPTIMER_DMATA(27)                 /*!< DMA transfer address is GPTIMER_ADCCR1 */
#define GPTIMER_DMACFG_DMATA_ADCCR2                        GPTIMER_DMATA(28)                 /*!< DMA transfer address is GPTIMER_ADCCR2 */
#define GPTIMER_DMACFG_DMATA_ADCTRGS                       GPTIMER_DMATA(29)                 /*!< DMA transfer address is GPTIMER_ADCTRGS */
#define GPTIMER_DMACFG_DMATA_ADDINTSCTL0                   GPTIMER_DMATA(30)                 /*!< DMA transfer address is GPTIMER_ADDINTSCTL0 */
#define GPTIMER_DMACFG_DMATA_ADDINTSCTL1                   GPTIMER_DMATA(31)                 /*!< DMA transfer address is GPTIMER_ADDINTSCTL1 */
#define GPTIMER_DMACFG_DMATA_IADCTSS                       GPTIMER_DMATA(32)                 /*!< DMA transfer address is GPTIMER_IADCTSS */
#define GPTIMER_DMACFG_DMATA_CREP                          GPTIMER_DMATA(33)                 /*!< DMA transfer address is GPTIMER_CREP */
#define GPTIMER_DMACFG_DMATA_SYNRSTCTL                     GPTIMER_DMATA(34)                 /*!< DMA transfer address is GPTIMER_SYNRSTCTL */

/* DMA access burst length */
#define GPTIMER_DMATC(regval)                              (BITS(8, 13) & ((uint32_t)(regval) << 8U))
#define GPTIMER_DMACFG_DMATC_1TRANSFER                     GPTIMER_DMATC(0)                  /*!< DMA transfer 1 time */
#define GPTIMER_DMACFG_DMATC_2TRANSFER                     GPTIMER_DMATC(1)                  /*!< DMA transfer 2 times */
#define GPTIMER_DMACFG_DMATC_3TRANSFER                     GPTIMER_DMATC(2)                  /*!< DMA transfer 3 times */
#define GPTIMER_DMACFG_DMATC_4TRANSFER                     GPTIMER_DMATC(3)                  /*!< DMA transfer 4 times */
#define GPTIMER_DMACFG_DMATC_5TRANSFER                     GPTIMER_DMATC(4)                  /*!< DMA transfer 5 times */
#define GPTIMER_DMACFG_DMATC_6TRANSFER                     GPTIMER_DMATC(5)                  /*!< DMA transfer 6 times */
#define GPTIMER_DMACFG_DMATC_7TRANSFER                     GPTIMER_DMATC(6)                  /*!< DMA transfer 7 times */
#define GPTIMER_DMACFG_DMATC_8TRANSFER                     GPTIMER_DMATC(7)                  /*!< DMA transfer 8 times */
#define GPTIMER_DMACFG_DMATC_9TRANSFER                     GPTIMER_DMATC(8)                  /*!< DMA transfer 9 times */
#define GPTIMER_DMACFG_DMATC_10TRANSFER                    GPTIMER_DMATC(9)                  /*!< DMA transfer 10 times */
#define GPTIMER_DMACFG_DMATC_11TRANSFER                    GPTIMER_DMATC(10)                 /*!< DMA transfer 11 times */
#define GPTIMER_DMACFG_DMATC_12TRANSFER                    GPTIMER_DMATC(11)                 /*!< DMA transfer 12 times */
#define GPTIMER_DMACFG_DMATC_13TRANSFER                    GPTIMER_DMATC(12)                 /*!< DMA transfer 13 times */
#define GPTIMER_DMACFG_DMATC_14TRANSFER                    GPTIMER_DMATC(13)                 /*!< DMA transfer 14 times */
#define GPTIMER_DMACFG_DMATC_15TRANSFER                    GPTIMER_DMATC(14)                 /*!< DMA transfer 15 times */
#define GPTIMER_DMACFG_DMATC_16TRANSFER                    GPTIMER_DMATC(15)                 /*!< DMA transfer 16 times */
#define GPTIMER_DMACFG_DMATC_17TRANSFER                    GPTIMER_DMATC(16)                 /*!< DMA transfer 17 times */
#define GPTIMER_DMACFG_DMATC_18TRANSFER                    GPTIMER_DMATC(17)                 /*!< DMA transfer 18 times */
#define GPTIMER_DMACFG_DMATC_19TRANSFER                    GPTIMER_DMATC(18)                 /*!< DMA transfer 19 times */
#define GPTIMER_DMACFG_DMATC_20TRANSFER                    GPTIMER_DMATC(19)                 /*!< DMA transfer 20 times */
#define GPTIMER_DMACFG_DMATC_21TRANSFER                    GPTIMER_DMATC(20)                 /*!< DMA transfer 21 times */
#define GPTIMER_DMACFG_DMATC_22TRANSFER                    GPTIMER_DMATC(21)                 /*!< DMA transfer 22 times */
#define GPTIMER_DMACFG_DMATC_23TRANSFER                    GPTIMER_DMATC(22)                 /*!< DMA transfer 23 times */
#define GPTIMER_DMACFG_DMATC_24TRANSFER                    GPTIMER_DMATC(23)                 /*!< DMA transfer 24 times */
#define GPTIMER_DMACFG_DMATC_25TRANSFER                    GPTIMER_DMATC(24)                 /*!< DMA transfer 25 times */
#define GPTIMER_DMACFG_DMATC_26TRANSFER                    GPTIMER_DMATC(25)                 /*!< DMA transfer 26 times */
#define GPTIMER_DMACFG_DMATC_27TRANSFER                    GPTIMER_DMATC(26)                 /*!< DMA transfer 27 times */
#define GPTIMER_DMACFG_DMATC_28TRANSFER                    GPTIMER_DMATC(27)                 /*!< DMA transfer 28 times */
#define GPTIMER_DMACFG_DMATC_29TRANSFER                    GPTIMER_DMATC(28)                 /*!< DMA transfer 29 times */
#define GPTIMER_DMACFG_DMATC_30TRANSFER                    GPTIMER_DMATC(29)                 /*!< DMA transfer 30 times */
#define GPTIMER_DMACFG_DMATC_31TRANSFER                    GPTIMER_DMATC(30)                 /*!< DMA transfer 31 times */
#define GPTIMER_DMACFG_DMATC_32TRANSFER                    GPTIMER_DMATC(31)                 /*!< DMA transfer 32 times */
#define GPTIMER_DMACFG_DMATC_33TRANSFER                    GPTIMER_DMATC(32)                 /*!< DMA transfer 33 times */
#define GPTIMER_DMACFG_DMATC_34TRANSFER                    GPTIMER_DMATC(33)                 /*!< DMA transfer 34 times */
#define GPTIMER_DMACFG_DMATC_35TRANSFER                    GPTIMER_DMATC(34)                 /*!< DMA transfer 35 times */

/* center-aligned mode selection */
#define GPTIMER_COUNTER_EDGE                               ((uint32_t)0x00000000U)           /*!< edge-aligned mode */
#define GPTIMER_COUNTER_CENTER                             GPTIMER_CTL0_CAM                  /*!< center-aligned mode */

