burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* count direction */
#define GPTIMER_COUNTER_UP                                 ((uint32_t)0x0000U)               /*!< counter up direction */
#define GPTIMER_COUNTER_DOWN                               ((uint32_t)GPTIMER_CTL0_DIR)      /*!< counter down direction */

/* specify division ratio between GPTIMER clock and dead-time and sampling clock */
#define GPTIMER_CTL0_CKDIVSION(regval)                     ((uint32_t)(BITS(8, 9) & ((uint32_t)(regval) << 8U)))
#define GPTIMER_CKDIV_DIV1                                 GPTIMER_CTL0_CKDIVSION(0)         /*!< clock division value is 1, fDTS=fTIMER_CK */
#define GPTIMER_CKDIV_DIV2                                 GPTIMER_CTL0_CKDIVSION(1)         /*!< clock division value is 2, fDTS= fTIMER_CK/2 */
#define GPTIMER_CKDIV_DIV4                                 GPTIMER_CTL0_CKDIVSION(2)         /*!< clock division value is 4, fDTS= fTIMER_CK/4 */

/* single pulse mode */
#define GPTIMER_SP_MODE_SINGLE                             ((uint32_t)0x00000000U)           /*!< single pulse mode */
#define GPTIMER_SP_MODE_REPETITIVE                         ((uint32_t)0x00000001U)           /*!< repetitive pulse mode */

/* repetition load mode */
#define GPTIMER_UPREP_LOAD_IMMEDIATELY                     ((uint32_t)0x00000000U)           /*!< repetition load immediately */
#define GPTIMER_UPREP_LOAD_NEXT_UPEVENT                    ((uint32_t)0x00000001U)           /*!< repetition load at next update */

/* global update source selection */
#define UPS_SEL(regval)                                    ((uint32_t)(BITS(16,17)&((uint32_t)(regval) << 16U)))
#define GPTIMER_GLOBAL_UPS_SEL_FLOW                        UPS_SEL(0)                        /*!< global update event source select counter overflow / underflow event */
#define GPTIMER_GLOBAL_UPS_SEL_OVERFLOW                    UPS_SEL(1)                        /*!< global update event source select counter overflow event */
#define GPTIMER_GLOBAL_UPS_SEL_UNDERFLOW                   UPS_SEL(2)                        /*!< global update event source select counter underflow event */

/* local update source selection */
#define REG_UPS_SEL(regval)                                ((uint32_t)(BITS(0,2)&((uint32_t)(regval) << 0U)))
#define GPTIMER_LOCAL_UPS_SEL_DISABLE                      REG_UPS_SEL(0)                    /*!< local update event source select disable*/
#define GPTIMER_LOCAL_UPS_SEL_OVERFLOW                     REG_UPS_SEL(1)                    /*!< local update event source select counter overflow event*/
#define GPTIMER_LOCAL_UPS_SEL_UNDERFLOW                    REG_UPS_SEL(2)                    /*!< local update event source select counter underflow event*/
#define GPTIMER_LOCAL_UPS_SEL_FLOW                         REG_UPS_SEL(3)                    /*!< local update event source select counter flow event*/
#define GPTIMER_LOCAL_UPS_SEL_CHCOM                        REG_UPS_SEL(4)                    /*!< local update event source select channel compare event*/

/* local update register */
#define GPTIMER_LOCAL_UP_CH0CV                             ((uint32_t)0x00000001U)           /*!< CH0CV local update */
#define GPTIMER_LOCAL_UP_CH0COMV_ADD                       ((uint32_t)0x00000002U)           /*!< CH0COMV_ADD local update */
#define GPTIMER_LOCAL_UP_CH1CV                             ((uint32_t)0x00000003U)           /*!< CH1CV local update */
#define GPTIMER_LOCAL_UP_CH1COMV_ADD                       ((uint32_t)0x00000004U)           /*!< CH1COMV_ADD local update */
#define GPTIMER_LOCAL_UP_ADCCR1                            ((uint32_t)0x00000005U)           /*!< ADC triggered comparison value 1 local update */
#define GPTIMER_LOCAL_UP_ADCCR2                            ((uint32_t)0x00000006U)           /*!< ADC triggered comparison value 2 local update */
#define GPTIMER_LOCAL_UP_CAR                               ((uint32_t)0x00000007U)           /*!< car local update */
#define GPTIMER_LOCAL_UP_CH0                               ((uint32_t)0x00000008U)           /*!< channel 0 output mode local update */
#define GPTIMER_LOCAL_UP_CH1                               ((uint32_t)0x00000009U)           /*!< channel 1 output mode local update */

/* match output level selection */
#define MATCH_LEVEL_SELECT(regval)                         ((uint32_t)(BITS(0,1)&((uint32_t)(regval) << 0U)))
#define GPTIMER_MATCH_OUTPUT_KEEP                          MATCH_LEVEL_SELECT(0)             /*!< match output level keep */
#define GPTIMER_MATCH_OUTPUT_LOW                           MATCH_LEVEL_SELECT(1)             /*!< match output low level */
#define GPTIMER_MATCH_OUTPUT_HIGH                          MATCH_LEVEL_SELECT(2)             /*!< match output high level */
#define GPTIMER_MATCH_OUTPUT_TOGGLE                        MATCH_LEVEL_SELECT(3)             /*!< match output level toggle */

/* period end output level selection */
#define PERIOD_END_LEVEL_SELECT(regval)                    ((uint32_t)(BITS(16,17)&((uint32_t)(regval) << 16U)))
#define GPTIMER_PERIOD_END_OUTPUT_KEEP                     PERIOD_END_LEVEL_SELECT(0)        /*!< period end output level keep */
#define GPTIMER_PERIOD_END_OUTPUT_LOW                      PERIOD_END_LEVEL_SELECT(1)        /*!< period end output low level */
#define GPTIMER_PERIOD_END_OUTPUT_HIGH                     PERIOD_END_LEVEL_SELECT(2)        /*!< period end output high level */
#define GPTIMER_PERIOD_END_OUTPUT_TOGGLE                   PERIOD_END_LEVEL_SELECT(3)        /*!< period end output level toggle */

/* output stop output level selection */
#define OUTPUT_STOP_LEVEL_SELECT(regval)                   ((uint32_t)(BITS(21,22)&((uint32_t)(regval) << 21U)))
#define GPTIMER_OUTPUT_STOP_OUTPUT_KEEP                    OUTPUT_STOP_LEVEL_SELECT(0)       /*!< output stop output level keep */
#define GPTIMER_OUTPUT_STOP_OUTPUT_HIZ                     OUTPUT_STOP_LEVEL_SELECT(1)       /*!< output stop output Hi-Z */
#define GPTIMER_OUTPUT_STOP_OUTPUT_LOW                     OUTPUT_STOP_LEVEL_SELECT(2)       /*!< output stop output low level */
#define GPTIMER_OUTPUT_STOP_OUTPUT_HIGH                    OUTPUT_STOP_LEVEL_SELECT(3)       /*!< output stop output high level*/

/* output stop recover time select */
#define GPTIMER_OUTPUT_RECOVER_PERIOD_END                  ((uint32_t)0x00000000U)           /*!< output stop recover time is period end */
#define GPTIMER_OUTPUT_RECOVER_CREP_END                    GPTIMER_CHCTL_STORESEL            /*!< output stop recover time is crep end */

