burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* counter enable or disable output control */
#define GPTIMER_CNT_ENABLE_DISABLE_OC_CTL                  ((uint32_t)0x00000000U)           /*!< counter enable or disable output level is determined by CH0ENOUT bit or CH0DISOUT bit */
#define GPTIMER_CNT_ENABLE_DISABLE_OC_KEEP                 GPTIMER_CH0CTL_CH0OUT             /*!< counter enable or disable output level holding */

/* counter enable output level */
#define GPTIMER_CNT_ENABLE_OUTPUT_LOW                      ((uint32_t)0x00000000U)           /*!< counter enable output low level */
#define GPTIMER_CNT_ENABLE_OUTPUT_HIGH                     GPTIMER_CH0CTL_CH0ENOUT           /*!< counter enable output high level */

/* counter disable output level */
#define GPTIMER_CNT_DISABLE_OUTPUT_LOW                     ((uint32_t)0x00000000U)           /*!< counter disable output low level */
#define GPTIMER_CNT_DISABLE_OUTPUT_HIGH                    GPTIMER_CH0CTL_CH0DISOUT          /*!< counter disable output high level */

/* force duty output selection */
#define FORCE_DUTY_OUTPUT(regval)                          ((uint32_t)(BITS(12,13)&((uint32_t)(regval) << 12U)))
#define GPTIMER_COMPARE_DUTY_OUTPUT                        FORCE_DUTY_OUTPUT(0)              /*!< output duty by compare */
#define GPTIMER_FORCE_0_DUTY_OUTPUT                        FORCE_DUTY_OUTPUT(2)              /*!< output duty by force 0% */
#define GPTIMER_FORCE_100_DUTY_OUTPUT                      FORCE_DUTY_OUTPUT(3)              /*!< output duty by force 100% */

/* force duty end output level */
#define GPTIMER_FORCE_DUTY_END_BASE_OUTPUT_KEEP            ((uint32_t)0x00000000U)           /*!< force duty end output level keep */
#define GPTIMER_FORCE_DUTY_END_BASE_OUTPUT_COMPARE         GPTIMER_CH0CTL_CH0REDUTY          /*!< force duty end output compare level */

/* force duty output time */
#define GPTIMER_FORCE_DUTY_OUTPUT_NEXT_PERIOD              ((uint32_t)0x00000000U)           /*!< force duty output at next period */
#define GPTIMER_FORCE_DUTY_OUTPUT_IMMEDIATELY              GPTIMER_CH0CTL_CH0OUTCTL          /*!< force duty output immediately */

/* compare period end priority */
#define GPRIMER_PERIOD_END_OUTPUT_COMPARE                  ((uint32_t)0x00000000U)           /*!< period end output compare level */
#define GPRIMER_PERIOD_END_OUTPUT_KEEP                     GPTIMER_CH0CTL_CH0EFF             /*!< period end output level keep */

/* GPTIMER channel n(n=0,1) */
#define GPTIMER_CH0                                        ((uint16_t)0x0001U)               /*!< channel 0 */
#define GPTIMER_CH1                                        ((uint16_t)0x0002U)               /*!< channel 1 */

/* channel enable state */
#define GPTIMER_CHANNEL_ENABLE                             ((uint16_t)0x0001U)               /*!< channel enable */
#define GPTIMER_CHANNEL_DISABLE                            ((uint16_t)0x0000U)               /*!< channel disable */

/* channel output compare shadow enable */
#define GPTIMER_OC_SHADOW_ENABLE                           ((uint16_t)0x0001U)               /*!< channel output shadow state enable */
#define GPTIMER_OC_SHADOW_DISABLE                          ((uint16_t)0x0000U)               /*!< channel output shadow state disable */

/* channel input output select*/
#define GPTIMER_CHANNEL_OUTPUT                             ((uint32_t)0x00000000U)           /*!< channel output */
#define GPTIMER_CHANNEL_INPUT                              ((uint32_t)0x00000002U)           /*!< channel input */

/* channel input capture prescaler */
#define IC_PSC_DIV(regval)                                 ((uint32_t)(BITS(26,27)&((uint32_t)(regval) << 26U)))
#define GPTIMER_IC_PSC_DIV1                                IC_PSC_DIV(0)                     /*!< no prescaler */
#define GPTIMER_IC_PSC_DIV2                                IC_PSC_DIV(1)                     /*!< divided by 2 */
#define GPTIMER_IC_PSC_DIV4                                IC_PSC_DIV(2)                     /*!< divided by 4 */
#define GPTIMER_IC_PSC_DIV8                                IC_PSC_DIV(3)                     /*!< divided by 8 */

/* channel 1 complementary mode */
#define GPTIMER_CH1_MODE_INDEPENDENTLY                     ((uint32_t)0x00000000U)           /*!< channel 2 output mode independently */
#define GPTIMER_CH1_MODE_COMPLEMENTARY                     GPTIMER_CHCTL_CH1MSEL             /*!< channel 2 output mode complementary */

/* deadtime enable */
#define GPTIMER_DEADTIME_DISABLE                           ((uint32_t)0x00000000U)           /*!< deadtime disable */
#define GPTIMER_DEADTIME_ENABLE                            GPTIMER_CHCTL_DTEN                /*!< deadtime enable */

/* deadtime mode */
#define GPTIMER_DEADTIME_MODE_SYMMETRIC                    ((uint32_t)0x00000000U)           /*!< deadtime symmetric mode */
#define GPTIMER_DEADTIME_MODE_ASYMMETRIC                   GPTIMER_DTCTL_DTASYEN             /*!< deadtime asymmetric mode */

/* rising edge deadtime shadow */
#define GPTIMER_DT_RISING_SHADOW_DISABLE                   ((uint32_t)0x00000000U)           /*!< rising edge deadtime shadow disable */
#define GPTIMER_DT_RISING_SHADOW_ENABLE                    GPTIMER_DTCTL_REDTSEN             /*!< rising edge deadtime shadow enable */

/* falling edge deadtime shadow */
#define GPTIMER_DT_FALLING_SHADOW_DISABLE                  ((uint32_t)0x00000000U)           /*!< falling edge deadtime shadow disable */
#define GPTIMER_DT_FALLING_SHADOW_ENABLE                   GPTIMER_DTCTL_FEDTSEN             /*!< falling edge deadtime shadow enable */

/* flow skipping soucre selection */
#define FLOW_SKIP_SRC(regval)                              ((uint32_t)(BITS(4,5)&((uint32_t)(regval) << 4U)))
#define GPTIMER_FLOW_SKIP_SOURCE_NO                        FLOW_SKIP_SRC(0)                  /*!< no flow skipping */
#define GPTIMER_FLOW_SKIP_SOURCE_OVERFLOW                  FLOW_SKIP_SRC(1)                  /*!< overflow as flow skipping soucre */
#define GPTIMER_FLOW_SKIP_SOURCE_UNDERFLOW                 FLOW_SKIP_SRC(2)                  /*!< underflow as flow skipping soucre */
#define GPTIMER_FLOW_SKIP_SOURCE_FLOW                      FLOW_SKIP_SRC(3)                  /*!< overflow / underflow as flow skipping soucre */

/* interrupt skipping link register */
#define GPTIMER_SKIP_LINK_CH0CV                            GPTIMER_IADCTSS_CH0INTSL          /*!< interrupt skipping link channel 0 input capture/compare match */
#define GPTIMER_SKIP_LINK_CH1CV                            GPTIMER_IADCTSS_CH1INTSL          /*!< interrupt skipping link channel 1 input capture/compare match */
#define GPTIMER_SKIP_LINK_CH0COMV_ADD                      GPTIMER_IADCTSS_CH0AINTSL         /*!< interrupt skipping link channel 0 additional value compare match */
#define GPTIMER_SKIP_LINK_CH1COMV_ADD                      GPTIMER_IADCTSS_CH1AINTSL         /*!< interrupt skipping link channel 1 additional value compare match */
#define GPTIMER_SKIP_LINK_ADCCR1                           GPTIMER_IADCTSS_ADT1INTSL         /*!< interrupt skipping link trigger signal generated by ADTCV1[15:0] */
#define GPTIMER_SKIP_LINK_ADCCR2                           GPTIMER_IADCTSS_ADT2INTSL         /*!< interrupt skipping link trigger signal generated by ADTCV2[15:0] */

/* interrupt skipping number */
#define FLOW_SKIP_NUM(regval)                              ((uint32_t)(BITS(8,10)&((uint32_t)(regval) << 8U)))
#define GPTIMER_FLOW_SKIP_NUM_0                            FLOW_SKIP_NUM(0)                  /*!< interrupt skipping 0 */
#define GPTIMER_FLOW_SKIP_NUM_1                            FLOW_SKIP_NUM(1)                  /*!< interrupt skipping 1 */
#define GPTIMER_FLOW_SKIP_NUM_2                            FLOW_SKIP_NUM(2)                  /*!< interrupt skipping 2 */
#define GPTIMER_FLOW_SKIP_NUM_3                            FLOW_SKIP_NUM(3)                  /*!< interrupt skipping 3 */
#define GPTIMER_FLOW_SKIP_NUM_4                            FLOW_SKIP_NUM(4)                  /*!< interrupt skipping 4 */
#define GPTIMER_FLOW_SKIP_NUM_5                            FLOW_SKIP_NUM(5)                  /*!< interrupt skipping 5 */
#define GPTIMER_FLOW_SKIP_NUM_6                            FLOW_SKIP_NUM(6)                  /*!< interrupt skipping 6 */
#define GPTIMER_FLOW_SKIP_NUM_7                            FLOW_SKIP_NUM(7)                  /*!< interrupt skipping 7 */

