burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMERx(x=0,1) write cc register selection */
#define GPTIMER_CHVSEL_ENABLE                              GPTIMER_CFG_CHVSEL                /*!< write CHxVAL register selection enable  */
#define GPTIMER_CHVSEL_DISABLE                             ((uint16_t)0x0000U)               /*!< write CHxVAL register selection disable */

/* GPTIMER adc_config*/
#define GPTIMER_ADC_COMPARE1                               ((uint16_t)0x0000U)               /*!< select GPTIMERx_ADCCR1 ADTCV1 */
#define GPTIMER_ADC_COMPARE2                               ((uint16_t)0x0001U)               /*!< select GPTIMERx_ADCCR2 ADTCV2 */

/* adc skipping counter */
#define GPTIMER_ADC_SKIP_COUNT1                            ((uint16_t)0x0000U)               /*!< adc skipping counter 1 */
#define GPTIMER_ADC_SKIP_COUNT2                            ((uint16_t)0x0001U)               /*!< adc skipping counter 2 */

/* adc skipping counter source */
#define ADC_SKIP_COUNT_SOURCE(regval)                      ((uint32_t)(BITS(0,1)&((uint32_t)(regval) << 0U)))
#define GPTIMER_ADC_SKIP_NO                                ADC_SKIP_COUNT_SOURCE(0)          /*!< no adc skipping counter source */
#define GPTIMER_ADC_SKIP_ADTCV1                            ADC_SKIP_COUNT_SOURCE(1)          /*!< the ADTCV1[15:0] comparison matching */
#define GPTIMER_ADC_SKIP_ADTCV2                            ADC_SKIP_COUNT_SOURCE(2)          /*!< the ADTCV2[15:0] comparison matching */
#define GPTIMER_ADC_SKIP_ADTCV1_OR_ADTCV2                  ADC_SKIP_COUNT_SOURCE(3)          /*!< the ADTCV1[15:0] or ADTCV2[15:0] comparison matching */

/* adc skipping req source selection */
#define ADC_REQ_SOURCE(regval)                             ((uint32_t)(BITS(0,2)&((uint32_t)(regval) << 0U)))
#define GPTIMER_ADC_REQ_NO                                 ADC_REQ_SOURCE(0)                 /*!< do not skipping */
#define GPTIMER_ADC_REQ_CNT1_ZERO                          ADC_REQ_SOURCE(1)                 /*!< adc req source when skipping counter 1 equal 0 */
#define GPTIMER_ADC_REQ_CNT2_ZERO                          ADC_REQ_SOURCE(2)                 /*!< adc req source when skipping counter 2 equal 0 */
#define GPTIMER_ADC_REQ_CNT1_OR_CNT2_ZERO                  ADC_REQ_SOURCE(3)                 /*!< adc req source when skipping counter 1/2 equal 0 */
#define GPTIMER_ADC_REQ_CNT1_SVAL                          ADC_REQ_SOURCE(5)                 /*!< adc req source when skipping counter 1 equal skipping value */
#define GPTIMER_ADC_REQ_CNT2_SVAL                          ADC_REQ_SOURCE(6)                 /*!< adc req source when skipping counter 2 equal skipping value */
#define GPTIMER_ADC_REQ_CNT1_OR_CNT2_SVAL                  ADC_REQ_SOURCE(7)                 /*!< adc req source when skipping counter 1/2 equal skipping value */

/* additional interrupt skipping counter */
#define GPTIMER_ADDINT_SKIP_COUNT1                         ((uint16_t)0x0000U)               /*!< additional interrupt skipping counter 1 */
#define GPTIMER_ADDINT_SKIP_COUNT2                         ((uint16_t)0x0001U)               /*!< additional interrupt skipping counter 2 */

/* additional interrupt skipping counter source */
#define ADDINT_SKIP_SOURCE(regval)                         ((uint32_t)(BITS(0,1)&((uint32_t)(regval) << 0U)))
#define GPTIMER_ADDINT_SKIP_NO                             ADDINT_SKIP_SOURCE(0)             /*!< no additional interrupt skipping counter source */
#define GPTIMER_ADDINT_SKIP_OVERFLOW                       ADDINT_SKIP_SOURCE(1)             /*!< overflow as additional skipping counter source  */
#define GPTIMER_ADDINT_SKIP_UNDERFLOW                      ADDINT_SKIP_SOURCE(2)             /*!< underflow as additional skipping counter source */
#define GPTIMER_ADDINT_SKIP_FLOW                           ADDINT_SKIP_SOURCE(3)             /*!< overflow and underflow as additional skipping counter source */

/* additional interrupt skipping req source selection */
#define ADDINT_REQ_SOURCE(regval)                          ((uint32_t)(BITS(0,2)&((uint32_t)(regval) << 0U)))
#define GPTIMER_ADDINT_REQ_NO                              ADDINT_REQ_SOURCE(0)              /*!< do not skipping */
#define GPTIMER_ADDINT_REQ_CNT1_ZERO                       ADDINT_REQ_SOURCE(1)              /*!< additional interrupt req source when skipping counter 1 equal 0 */
#define GPTIMER_ADDINT_REQ_CNT2_ZERO                       ADDINT_REQ_SOURCE(2)              /*!< additional interrupt req source when skipping counter 2 equal 0 */
#define GPTIMER_ADDINT_REQ_CNT1_OR_CNT2_ZERO               ADDINT_REQ_SOURCE(3)              /*!< additional interrupt req source when skipping counter 1/2 equal 0 */
#define GPTIMER_ADDINT_REQ_CNT1_SVAL                       ADDINT_REQ_SOURCE(5)              /*!< additional interrupt req source when skipping counter 1 equal skipping value */
#define GPTIMER_ADDINT_REQ_CNT2_SVAL                       ADDINT_REQ_SOURCE(6)              /*!< additional interrupt req source when skipping counter 2 equal skipping value */
#define GPTIMER_ADDINT_REQ_CNT1_OR_CNT2_SVAL               ADDINT_REQ_SOURCE(7)              /*!< additional interrupt req source when skipping counter 1/2 equal skipping value */

/* additional interrupt skipping event selection */
#define GPTIMER_ADDINT_SKIP_EVENT_CH0CV                    ((uint32_t)0x00000001U)           /*!< additional interrupt skipping event ch0cv */
#define GPTIMER_ADDINT_SKIP_EVENT_CH1CV                    ((uint32_t)0x00000002U)           /*!< additional interrupt skipping event ch1cv */
#define GPTIMER_ADDINT_SKIP_EVENT_CH0COMV_ADD              ((uint32_t)0x00000003U)           /*!< additional interrupt skipping event ch0comv_add */
#define GPTIMER_ADDINT_SKIP_EVENT_CH1COMV_ADD              ((uint32_t)0x00000004U)           /*!< additional interrupt skipping event ch1comv_add */
#define GPTIMER_ADDINT_SKIP_EVENT_UNDERFLOW                ((uint32_t)0x00000005U)           /*!< additional interrupt skipping event underflow */
#define GPTIMER_ADDINT_SKIP_EVENT_OVERFLOW                 ((uint32_t)0x00000006U)           /*!< additional interrupt skipping event overflow */
#define GPTIMER_ADDINT_SKIP_EVENT_ADTCV1                   ((uint32_t)0x00000007U)           /*!< additional interrupt skipping event adtcv1 */
#define GPTIMER_ADDINT_SKIP_EVENT_ADTCV2                   ((uint32_t)0x00000008U)           /*!< additional interrupt skipping event adtcv2 */

