burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* adc monitor signal */
#define GPTIMER_ADCSM3                                     ((uint16_t)0x0000U)               /*!< adc monitor signal 3 */
#define GPTIMER_ADCSM4                                     ((uint16_t)0x0001U)               /*!< adc monitor signal 4 */

/* adc monitor signal */
#define GPTIMER_ADSM_ADTCV1                                ((uint32_t)0x00000000U)           /*!< adc monitor signal ADTCV1 */
#define GPTIMER_ADSM_ADTCV2                                ((uint32_t)0x00000001U)           /*!< adc monitor signal ADTCV2 */

/* adc trigger signal enable */
#define GPTIMER_ADT1UEN                                    GPTIMER_ADCTL_ADT1UPGTEN          /*!< enable counter up ADTCV1[15:0] match event as adc trigger signal */
#define GPTIMER_ADT1DEN                                    GPTIMER_ADCTL_ADT1DWGTEN          /*!< enable counter down ADTCV1[15:0] match event as adc trigger signal */
#define GPTIMER_ADT2UEN                                    GPTIMER_ADCTL_ADT2UPGTEN          /*!< enable counter up ADTCV2[15:0] match event as adc trigger signal */
#define GPTIMER_ADT2DEN                                    GPTIMER_ADCTL_ADT2DWGTEN          /*!< enable counter down ADTCV2[15:0] match event as adc trigger signal */

/* output stop group selection */
#define STOP_GTOC_SELECT(regval)                           ((uint32_t)(BITS(24,25)&((uint32_t)(regval) << 24U)))
#define GPTIMER_OUTPUT_STOP_GTOC0                          STOP_GTOC_SELECT(0)               /*!< output stop GTOC0 */
#define GPTIMER_OUTPUT_STOP_GTOC1                          STOP_GTOC_SELECT(1)               /*!< output stop GTOC1 */
#define GPTIMER_OUTPUT_STOP_GTOC2                          STOP_GTOC_SELECT(2)               /*!< output stop GTOC2 */
#define GPTIMER_OUTPUT_STOP_GTOC3                          STOP_GTOC_SELECT(3)               /*!< output stop GTOC3 */

/* counter synchronization control set */
#define GPTIMER_SYNRSTCTL_SYNCSSEL_SEL(regval)            ((uint32_t)(BIT(21)&((uint32_t)(regval) << 21U)))
#define GPTIMER_SYNRSTCTL_SYNCSSEL_SET0                    GPTIMER_SYNRSTCTL_SYNCSSEL_SEL(0) /*!< synchronization control set0 */
#define GPTIMER_SYNRSTCTL_SYNCSSEL_SET1                    GPTIMER_SYNRSTCTL_SYNCSSEL_SEL(1) /*!< synchronization control set1 */

/* counter sync reset source selection */
#define GPTIMER_SYNC_RESET_CH0CV                           GPTIMER_SYNRSTCTL_CH0RETEN        /*!< ch0cv as counter sync reset source */
#define GPTIMER_SYNC_RESET_CH1CV                           GPTIMER_SYNRSTCTL_CH1RETEN        /*!< ch1cv as counter sync reset source */
#define GPTIMER_SYNC_RESET_CH0COMV_ADD                     GPTIMER_SYNRSTCTL_CH0ARETEN       /*!< ch0comval_add as counter sync reset source */
#define GPTIMER_SYNC_RESET_CH1COMV_ADD                     GPTIMER_SYNRSTCTL_CH1ARETEN       /*!< ch1comval_add as counter sync reset source */
#define GPTIMER_SYNC_RESET_OF                              GPTIMER_SYNRSTCTL_OVRETEN         /*!< overflow as counter sync reset source */
#define GPTIMER_SYNC_RESET_UF                              GPTIMER_SYNRSTCTL_UNDRETEN        /*!< underflow as counter sync reset source */
#define GPTIMER_SYNC_RESET_CH                              GPTIMER_SYNRSTCTL_CHSRETEN        /*!< channel input as counter sync reset source */

/* function declarations */
/* GPTIMER timebase */
/* deinit GPTIMER */
void gptimer_deinit(uint32_t timer_periph);
/* initialize GPTIMER init parameter struct with a default value */
void gptimer_struct_para_init(gptimer_parameter_struct *initpara);
/* initialize GPTIMER counter */
void gptimer_init(uint32_t timer_periph, gptimer_parameter_struct *initpara);
/* enable GPTIMER register write protect function */
void gptimer_register_write_protect_enable(uint32_t timer_periph, uint32_t register_protect);
/* disable GPTIMER register write protect function */
void gptimer_register_write_protect_disable(uint32_t timer_periph, uint32_t register_protect);
/* select a GPTIMER clock source */
void gptimer_clock_source_select(uint32_t timer_periph, uint32_t clock_source);
/* configure a GPTIMER clock polarity */
void gptimer_clock_polarity_config(uint32_t timer_periph, uint32_t clock_polarity);
/* software enable GPTIMER counter */
void gptimer_counter_software_enable(uint32_t timer_periph, uint32_t timer_cnt);
/* software disable GPTIMER counter */
void gptimer_counter_software_disable(uint32_t timer_periph, uint32_t timer_cnt);
/* software reset GPTIMER counter */
void gptimer_counter_software_reset(uint32_t timer_periph, uint32_t timer_cnt);
/* initialize GPTIMER counter enable source init parameter struct with a default value */
void gptimer_counter_enable_source_struct_para_init(gptimer_counter_enable_source_parameter_struct
                                                    *counter_enable_source_para);
/* config GPTIMER counter enable source */
void gptimer_counter_enable_source_config(uint32_t timer_periph,
                                          gptimer_counter_enable_source_parameter_struct *counter_enable_source_para);
/* initialize GPTIMER counter disable source init parameter struct with a default value */
void gptimer_counter_disable_source_struct_para_init(gptimer_counter_disable_source_parameter_struct
                                                     *counter_disable_source_para);
/* config GPTIMER counter disable source */
void gptimer_counter_disable_source_config(uint32_t timer_periph,
                                           gptimer_counter_disable_source_parameter_struct *counter_disable_source_para);
/* initialize GPTIMER counter reset source init parameter struct with a default value */
void gptimer_counter_reset_source_struct_para_init(gptimer_counter_reset_source_parameter_struct
                                                   *counter_reset_source_para);
/* config GPTIMER counter reset source */
void gptimer_counter_reset_source_config(uint32_t timer_periph,
                                         gptimer_counter_reset_source_parameter_struct *counter_reset_source_para);
/* initialize GPTIMER counter up source init parameter struct with a default value */
void gptimer_counter_up_source_struct_para_init(gptimer_counter_up_source_parameter_struct *counter_up_source_para);
/* config GPTIMER counter up source */
void gptimer_counter_up_source_config(uint32_t timer_periph,
                                      gptimer_counter_up_source_parameter_struct *counter_up_source_para);
/* initialize GPTIMER counter down source init parameter struct with a default value */
void gptimer_counter_down_source_struct_para_init(gptimer_counter_down_source_parameter_struct
                                                  *counter_down_source_para);
/* config GPTIMER counter down source */
void gptimer_counter_down_source_config(uint32_t timer_periph,
                                        gptimer_counter_down_source_parameter_struct *counter_down_source_para);
/* select counter up input level source */
void gptimer_counter_up_input_level_source_select(uint32_t timer_periph, uint32_t input_source);
/* select counter down input level source */
void gptimer_counter_down_input_level_source_select(uint32_t timer_periph, uint32_t input_source);

/* enable GPTIMER */
void gptimer_enable(uint32_t timer_periph);
/* disable GPTIMER */
void gptimer_disable(uint32_t timer_periph);
/* enable the auto reload shadow function */
void gptimer_auto_reload_shadow_enable(uint32_t timer_periph);
/* disable the auto reload shadow function */
void gptimer_auto_reload_shadow_disable(uint32_t timer_periph);
/* enable the update event */
void gptimer_update_event_enable(uint32_t timer_periph);
/* disable the update event */
void gptimer_update_event_disable(uint32_t timer_periph);
/* set counter alignment mode */
void gptimer_counter_alignment(uint32_t timer_periph, uint16_t aligned);
/* set counter up direction */
void gptimer_counter_up_direction(uint32_t timer_periph);
/* set counter down direction */
void gptimer_counter_down_direction(uint32_t timer_periph);
/* enable counter direction force set */
void gptimer_counter_direction_force_set_enable(uint32_t timer_periph);
/* disable counter direction force set */
void gptimer_counter_direction_force_set_disable(uint32_t timer_periph);
/* select register global update source */
void gptimer_register_global_update_source_select(uint32_t timer_periph, uint32_t source);
/* select register local update source */
void gptimer_register_local_update_source_select(uint32_t timer_periph, uint32_t reg, uint32_t source);
/* configure prescaler */
void gptimer_prescaler_config(uint32_t timer_periph, uint16_t prescaler);
/* configure update repetition register value */
void gptimer_update_repetition_value_config(uint32_t timer_periph, uint16_t repetition, uint32_t load_mode);
/* read update repetition register value */
uint16_t gptimer_update_repetition_counter_read(uint32_t timer_periph);
/* configure autoreload register value */
void gptimer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload);
/* configure counter register value */
void gptimer_counter_value_config(uint32_t timer_periph, uint32_t counter);
/* read counter value */
uint32_t gptimer_counter_read(uint32_t timer_periph);
/* read prescaler value */
uint16_t gptimer_prescaler_read(uint32_t timer_periph);
/* configure single pulse mode */
void gptimer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode);

/* GPTIMER DMA and event */
/* enable the DMA */
void gptimer_dma_enable(uint32_t timer_periph, uint32_t dma);
/* disable the DMA */
void gptimer_dma_disable(uint32_t timer_periph, uint32_t dma);
/* configure the DMA transfer */
void gptimer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth);

