burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_gptimer.h
/* GPTIMER channel output */
/* initialize GPTIMER channel output parameter struct with a default value */
void gptimer_channel_output_struct_para_init(gptimer_oc_parameter_struct *ocpara);
/* configure channel output mode */
void gptimer_channel_output_config(uint32_t timer_periph, uint16_t channel, gptimer_oc_parameter_struct *ocpara);
/* configure channel output force duty */
void gptimer_channel_output_force_duty_config(uint32_t timer_periph, uint16_t channel, uint32_t duty,
                                              uint32_t output_time);
/* configure channel output compare value */
void gptimer_channel_output_compare_value_config(uint32_t timer_periph, uint16_t channel, uint16_t value);
/* configure channel output additional compare value */
void gptimer_channel_output_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint16_t value);
/* configure channel output shadow function */
void gptimer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* configure channel output additional shadow function */
void gptimer_channel_output_additional_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* configure channel output shadow function */
void gptimer_channel_output_control_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow);
/* enable two channel simultaneous output high check function */
void gptimer_two_channel_output_high_check_enable(uint32_t timer_periph);
/* disable two channel simultaneous output high check function */
void gptimer_two_channel_output_high_check_disable(uint32_t timer_periph);
/* enable two channel simultaneous output low check function */
void gptimer_two_channel_output_low_check_enable(uint32_t timer_periph);
/* disable two channel simultaneous output low check function */
void gptimer_two_channel_output_low_check_disable(uint32_t timer_periph);
/* enable counter cycle synchronization signal output */
void gptimer_period_signal_output_enable(uint32_t timer_periph);
/* disable counter cycle synchronization signal output */
void gptimer_period_signal_output_disable(uint32_t timer_periph);
/* configure stop output source */
void gptimer_stop_output_set_select(uint32_t timer_periph, uint32_t group);
/* output stop recover time select */
void gptimer_stop_output_recover_time_select(uint32_t timer_periph, uint32_t time);
/* initialize GPTIMER complementary output parameter struct with a default value*/
void gptimer_channel_complementary_output_struct_para_init(gptimer_com_oc_parameter_struct *comocpara);
/* configure GPTIMER complementary channel output function */
void gptimer_channel_complementary_output_config(uint32_t timer_periph, gptimer_com_oc_parameter_struct *comocpara);
/* configure channel input or output */
void gptimer_channel_io_direction_config(uint32_t timer_periph, uint16_t channel, uint32_t io_direction);
/* configure channel input or output enable state */
void gptimer_channel_io_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state);

/* GPTIMER channel input */
/* initialize GPTIMER counter capture source init parameter struct with a default value */
void gptimer_capture_source_struct_para_init(gptimer_capture_source_parameter_struct *counter_capture_source_para);
/* config GPTIMER counter capture source */
void gptimer_capture_source_config(uint32_t timer_periph, uint16_t channel,
                                   gptimer_capture_source_parameter_struct *capture_source_para);
/* configure channel input capture filter */
void gptimer_channel_input_capture_filter_config(uint32_t timer_periph, uint32_t channel, uint32_t number);
/* configure channel input capture prescaler */
void gptimer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint32_t prescaler);
/* read channel capture compare register value */
uint32_t gptimer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel);

/* select synchronization control set */
void gptimer_counter_sync_control_select(uint32_t timer_periph, uint32_t set);
/* select counter sync reset source */
void gptimer_counter_sync_reset_source_select(uint32_t timer_periph, uint32_t source, ControlStatus newvalue);

/* GPTIMER skipping config*/
/* enable compare event produce a ADC converter trigger signal */
void gptimer_trigger_adc_compare_enable(uint32_t timer_periph, uint32_t compare_time);
/* disable compare event produce a ADC converter trigger signal */
void gptimer_trigger_adc_compare_disable(uint32_t timer_periph, uint32_t compare_time);
/* config trigger adc compare regiseter value  */
void gptimer_trigger_adc_compare_value_config(uint32_t timer_periph, uint32_t compare,  uint16_t value);
/* enable adc compare regiseter shadow function */
void gptimer_trigger_adc_compare_shadow_enable(uint32_t timer_periph, uint32_t compare);
/* disable adc compare regiseter shadow function */
void gptimer_trigger_adc_compare_shadow_disable(uint32_t timer_periph, uint32_t compare);
/* enable trigger adc adsm signal */
void gptimer_trigger_adc_adsm_enable(uint32_t timer_periph, uint32_t adsm);
/* disable trigger adc adsm signal*/
void gptimer_trigger_adc_adsm_disable(uint32_t timer_periph, uint32_t adsm);
/* select trigger adc adsm signal */
void gptimer_trigger_adc_adsm_select(uint32_t timer_periph, uint32_t adsm, uint32_t trg_source);
/* config trigger adc skipping value */
void gptimer_trigger_adc_skipping_config(uint32_t timer_periph, uint32_t skipping_count, uint32_t value, uint32_t initial_value,
                                         uint32_t skipping_source);
/* select trigger adc skipping time */
void gptimer_trigger_adc_skipping_time_select(uint32_t timer_periph, uint32_t compare,  uint32_t skipping_time);
/* read trigger adc skipping counter */
uint16_t gptimer_trigger_adc_skipping_counter_read(uint32_t timer_periph, uint32_t skipping_count);
/* config additional interrupt skipping value */
void gptimer_additional_interrupt_skipping_config(uint32_t timer_periph, uint32_t skipping_count, uint32_t value,
                                                  uint32_t initial_value, uint32_t skipping_source);
/* select additional interrupt skipping time */
void gptimer_additional_interrupt_skipping_time_select(uint32_t timer_periph, uint32_t event, uint32_t skipping_time);
/* read additional interrupt skipping counter */
uint16_t gptimer_additional_interrupt_skipping_counter_read(uint32_t timer_periph, uint32_t skipping_count);
/* select flow interrupt skipping source */
void gptimer_flow_interrupt_skipping_source_select(uint32_t timer_periph, uint32_t skipping_source);
/* enable flow interrupt skipping_link function */
void gptimer_flow_interrupt_skipping_link_enable(uint32_t timer_periph, uint32_t skipping_link_source);
/* disable flow interrupt skipping_link function */
void gptimer_flow_interrupt_skipping_link_disable(uint32_t timer_periph, uint32_t skipping_link_source);
/* configure flow interrupt repetition skipping number */
void gptimer_flow_interrupt_skipping_num_config(uint32_t timer_periph, uint32_t number);
/* read flow interrupt skipping counter value */
uint16_t gptimer_flow_interrupt_skipping_counter_read(uint32_t timer_periph);
/* configure write CHxVAL register selection */
void gptimer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel);

/* GPTIMER interrupt and flag*/
/* get GPTIMER flags */
FlagStatus gptimer_flag_get(uint32_t timer_periph, uint32_t flag);
/* clear GPTIMER flags */
void gptimer_flag_clear(uint32_t timer_periph, uint32_t flag);
/* enable the GPTIMER interrupt */
void gptimer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt);
/* disable the GPTIMER interrupt */
void gptimer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt);
/* get GPTIMER interrupt flags */
FlagStatus gptimer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag);
/* clear GPTIMER interrupt flags */
void gptimer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag);

#endif /* GD32M53X_GPTIMER_H */
